//DynamicDirective
Функция controls_forEachAsync_get_items(context, block_context)
	Если block_context["page"]> 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;	
	
	Список = get_prop(block_context, "LIST");
	Если Список = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли 	ТипЗнч(Список) = Тип("Массив") 
				ИЛИ ТипЗнч(Список) = Тип("СписокЗначений") 
				ИЛИ ТипЗнч(Список) = Тип("ТаблицаЗначений")
				ИЛИ ЭтоТипТабличнаяЧасть(Список) Тогда
		Возврат Список;
	Иначе     
		dump = Новый Структура("Список",Список);
		ВызватьИсключение NewExtExceptionСтрока(,"В блок цикла передано не итерируемое значение.", block_context["_path"],,dump );	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
