
// Функция block_lists_indexOf_calc_value
//
// Параметры:
//  block_type - Строка - Название блока
// 	node - Структура - Dom структура хмл
//  path - Строка - Пусть до блока по алгоритму
//  context - Структура - Общий контекст алгоритма
//  block_context - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Число - Размер массива
//
// BSLLS:CognitiveComplexity-off
//DynamicDirective
Функция block_lists_indexOf_calc_value(block_type, node, path, context, block_context)
	value = get_prop(block_context, "VALUE");
	end = get_prop(block_context, "END", "FIRST");
	find = get_prop(block_context, "FIND");
	// Проверка входных параметров
    Если value = Неопределено Тогда
        ВызватьИсключение NewExtExceptionСтрока(, "Ошибка в блоке", "Не заполнен обязательный параметр VALUE в блоке lists_indexOf");
	КонецЕсли;
	
	Если find = Неопределено Тогда
        ВызватьИсключение NewExtExceptionСтрока(, "Ошибка в блоке", "Не заполнен обязательный параметр FIND в блоке lists_indexOf");
    КонецЕсли;

	ТипСписка = ТипЗнч(value);
    Если ТипСписка <> Тип("Массив")
       И ТипСписка <> Тип("СписокЗначений") Тогда
        ВызватьИсключение "Поддерживается работа только со списками";
    КонецЕсли;
    КоличествоЭлементов = value.Количество();
    Если КоличествоЭлементов = 0 Тогда
        Возврат -1;
    КонецЕсли;
    ИскатьСНачала = (end = "FIRST");
    Если ИскатьСНачала Тогда
        Для Индекс = 0 По КоличествоЭлементов - 1 Цикл
            Если ТипСписка = Тип("СписокЗначений") Тогда
                ТекущееЗначение = value[Индекс].Значение;
            Иначе
                ТекущееЗначение = value[Индекс];
            КонецЕсли;
            Если ТекущееЗначение = find Тогда
                Возврат Индекс;
            КонецЕсли;
        КонецЦикла;
	Иначе
		Индекс = КоличествоЭлементов - 1;
      	Пока Индекс >= 0 Цикл
            Если ТипСписка = Тип("СписокЗначений") Тогда
                ТекущееЗначение = value[Индекс].Значение;
            Иначе
                ТекущееЗначение = value[Индекс];
            КонецЕсли;
            Если ТекущееЗначение = find Тогда
                Возврат Индекс;
            КонецЕсли;
            Индекс = Индекс - 1;
        КонецЦикла;
    КонецЕсли;
    Возврат -1;		
КонецФункции	
// BSLLS:CognitiveComplexity-on
