
// Функция block_lists_set_index_calc_value
//
// Параметры:
//  block_type - Строка - Название блока
//  node - Структура - Dom структура хмл
//  path - Строка - Пусть до блока по алгоритму
//  context - Структура - Общий контекст алгоритма
//  block_context - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Массив - Результат выполнения метода
//
//DynamicDirective
Функция block_lists_set_index_calc_value(block_type, node, path, context, block_context)
	array = block_get_variable(context, block_context["VAR"]);
	mode = block_context["MODE"];
	where = block_context["WHERE"];
	value = block_context["TO"];
	Если array = value Тогда
		ВызватьИсключение "Объект не может быть добавлен в этот же объект"; 
	КонецЕсли;
	Если mode = "SET" Тогда
		Если where = "FROM_START" Тогда
			array.Вставить(block_context["AT"], value);
			Возврат array;
		ИначеЕсли where = "FROM_END" Тогда
			ВызватьИсключение "В блоке set index не поддерживается " + where
		ИначеЕсли where = "FIRST" Тогда
			array.Вставить(0, value);
			Возврат array;
		ИначеЕсли where = "LAST" Тогда
			Если Найти(Строка(array), "ТабличнаяЧасть") Тогда
				Возврат lists_set_index_calc_param_value(array, value);	
			ИначеЕсли Найти(Строка(array), "ТаблицаЗначений") Тогда
				Возврат lists_set_index_calc_table_param_value(array, value);					
			Иначе	
				array.Добавить(value);
				Возврат array;
			КонецЕсли;
		ИначеЕсли where = "RANDOM" Тогда
			ВызватьИсключение "В блоке set index не поддерживается " + where
		Иначе
			ВызватьИсключение "В блоке set index не поддерживается " + where
		КонецЕсли;	
	Иначе
		ВызватьИсключение "В блоке set index не поддерживается " + where
	КонецЕсли;	
КонецФункции

// Параметры:
//  array - ТабличнаяЧасть - Табличная часть документа
//  value - Структура - Добавляемая строка
//
// Возвращаемое значение:
//  - ТабличнаяЧасть - Результат добавления строки
//
Функция lists_set_index_calc_param_value(array, value)
	_variable = array.Добавить();
	Если ТипЗнч(value) = тип("Структура") ИЛИ ТипЗнч(value) = Тип("Соответствие") Тогда
		Для Каждого field Из value Цикл
			Попытка
				_variable[field.Ключ] = field.Значение;
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Возврат array;
КонецФункции

// Параметры:
//  array - ТаблицаЗначений - Входящая таблица значений
//  value - Структура - Добавляемая строка
//
// Возвращаемое значение:
//  - ТаблицаЗначений - Результат добавления строки
//
Функция lists_set_index_calc_table_param_value(array, value)
	Для Каждого field Из value Цикл
		ИмяКолонки = field.Ключ;
		Если array.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			Попытка
				array.Колонки.Добавить(ИмяКолонки);
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Строка = array.Добавить();
	Для Каждого field Из value Цикл
		Попытка
			Строка[field.Ключ] = field.Значение;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Возврат array;
КонецФункции
