
&НаСервере

Функция ОтсортироватьМассивНаСервере(МассивСтруктур, Поле, ЗначениеСортитовки)
	ВременнаяТаблица = МассивСоответствийВТаблицуЗначений(МассивСтруктур);
	ВременнаяТаблица.Сортировать(Поле + " " + ЗначениеСортитовки);
	Результат = ТаблицаЗначенийВМассив(ВременнаяТаблица);
	Возврат Результат;
КонецФункции

//DynamicDirective

Функция block_list_obj_sort_calc_value(block_type, node, path, context, block_context) Экспорт
	Результат = Неопределено;

	required_param = Новый Массив;
	required_param.Добавить("VAR");
	required_param.Добавить("PROP");
	required_param.Добавить("ORDER");
	block_check_required_param_in_block_context(required_param, block_context);
	_var =		block_get_variable(context ,block_context["VAR"]);
	_prop =		block_context["PROP"];
	_order =	block_context["ORDER"];
	
	ЗначениеСортитовки = "Возр";	
	Если ВРег(_order) = "DESC" Тогда
		ЗначениеСортитовки = "Убыв";	
	КонецЕсли;
	
	ТипСписка = ТипЗнч(_var);
    Если ТипСписка = Тип("Массив") Тогда
		Результат = ОтсортироватьМассивНаСервере(_var, _prop, ЗначениеСортитовки);
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	    Если ТипСписка = Тип("ТаблицаЗначений")Тогда
			Результат = _var;
			Результат.Сортировать(_prop + " " + ЗначениеСортитовки);
		КонецЕсли;
	    Если ЭтоТипТабличнаяЧасть(_var) Тогда
			Результат = _var.Выгрузить();
			Результат.Сортировать(_prop + " " + ЗначениеСортитовки);
			_var.Загрузить(Результат);
			Результат = _var;
		КонецЕсли;
	#КонецЕсли
	block_set_variable(context, block_context["VAR"], Результат);
    Возврат Результат;
КонецФункции

