
// Функция ЗаполнениеФильтраСпискаДокументовИзФильтраАддона
//
// Параметры:
// 	Filter - Соответствие - Исходная структура фильтра
//
// Возвращаемое значение:
//  - Соответствие - Новый фильтр для метода СБИС.СписокДОкументов, заполненый по исходному фильтру
// 
//DynamicDirective
Функция ЗаполнениеФильтраСпискаДокументовИзФильтраАддона(Filter)
	Фильтр = Новый Соответствие;
	Фильтр.Вставить("Тип", Filter["Тип"]);
	Фильтр.Вставить("Навигация", Filter["Навигация"]);
	ДатаНач = get_prop(Filter, "ДатаНач");
	Если ДатаНач <> Неопределено Тогда
		ДатаС = ПреобразоватьСтрокуВДату("yyyy-MM-dd", ДатаНач);
		ДатаС = Формат(ДатаС, "ДФ=dd.MM.yyyy");
		Фильтр.Вставить("ДатаС", ДатаС);
	КонецЕсли;
	ДатаКнц = get_prop(Filter, "ДатаКнц");
	Если ДатаКнц <> Неопределено Тогда
		ДатаПо = ПреобразоватьСтрокуВДату("yyyy-MM-dd", ДатаКнц);
		ДатаПо = Формат(ДатаПо, "ДФ=dd.MM.yyyy");
		Фильтр.Вставить("ДатаПо", ДатаПо);
	КонецЕсли;
	Номер = get_prop(Filter, "Номер");
	Если Номер <> Неопределено Тогда
		Фильтр.Вставить("Маска", Номер);
	КонецЕсли;
	ФильтрМаска = get_prop(Filter, "ФильтрМаска");
	Если ЗначениеЗаполнено(ФильтрМаска) Тогда
		Фильтр.Вставить("Маска", ФильтрМаска);
	КонецЕсли;
	Состояние = get_prop(Filter, "Состояние");
	Если Состояние = "Требующие ответа" Тогда
		Фильтр.Вставить("Состояние", "Требующие ответа");
	КонецЕсли;
	Организация = get_prop(Filter, "Организация");
	Если Организация <> Неопределено Тогда
		НашаОрганизация = Новый Структура;
		ИНН = get_prop(Организация, "ИНН", "");
		Если СтрДлина(ИНН) = 10 Тогда
			КПП = get_prop(Организация, "КПП", "");
			НашаОрганизация.Вставить("СвЮЛ", Новый Структура("ИНН, КПП", ИНН, КПП));
		Иначе
			НашаОрганизация.Вставить("СвФЛ", Новый Структура("ИНН", ИНН));
		КонецЕсли;
		Фильтр.Вставить("НашаОрганизация", НашаОрганизация);
	КонецЕсли;
	Контрагент = get_prop(Filter, "Контрагент");
	Если Контрагент <> Неопределено Тогда
		НашКонтрагент = Новый Структура;
		ИНН = get_prop(Контрагент, "ИНН", "");
		Если СтрДлина(ИНН) = 10 Тогда
			КПП = get_prop(Контрагент, "КПП", "");
			НашКонтрагент.Вставить("СвЮЛ", Новый Структура("ИНН, КПП", ИНН, КПП));
		Иначе
			НашКонтрагент.Вставить("СвФЛ", Новый Структура("ИНН", ИНН));
		КонецЕсли;
		Фильтр.Вставить("Контрагент", НашКонтрагент);
	КонецЕсли;
	Возврат Фильтр;
КонецФункции

// Функция ДополнитьПоляРеестра
//
// Параметры:
// 	result - Соответствие - Результат выполнения СБИС.СписокДокументов
//  context - Структура - Общий контекст алгоритма
//
// Возвращаемое значение:
//  - Соответствие - Обогащенный/исправленный результат выполнения СБИС.СписокДокументов
// 
//DynamicDirective
Функция ДополнитьПоляРеестра(result, context)
	Реестр = Новый Массив;
	
	Доки = result["Документ"];
	ДополнитьСтатусамиИСНаСервере(Доки); // блок "Дополнить статусами ИС"
	Для Каждого Док ИЗ Доки Цикл
		НовыйДок = Новый Соответствие;
		
		НовыйДок.Вставить("ДокументСБИС", Док);
		НовыйДок.Вставить("ИмяИС", get_prop(Док, "ИмяИС"));
		НовыйДок.Вставить("ТипИС", get_prop(Док, "ТипИС"));
		НовыйДок.Вставить("ИдИС", get_prop(Док, "ИдИС"));
		НовыйДок.Вставить("Название", get_prop(Док, "Название"));
		
		ИмяСБИС = get_prop(Док, "Тип");
		Примечание = get_prop(Док, "Примечание");
		ИдентификаторДокумента = get_prop(Док, "Идентификатор"); 
		ИмяСБИС = ТипОбъектаАПИПоТипуСБИС(ИмяСБИС, Примечание, ИдентификаторДокумента, context.params); 
		
		НовыйДок.Вставить("ИмяСБИС", ИмяСБИС);
		НовыйДок.Вставить("ИдСБИС", ИдентификаторДокумента);
		НовыйДок.Вставить("Комментарий", Примечание);
		НовыйДок.Вставить("Представление", get_prop(Док, "Название"));
		НовыйДок.Вставить("СтатусСБИС", get_prop(get_prop(Док, "Состояние"), "Код"));
		НовыйДок.Вставить("ОбъектИС", get_prop(Док, "ДокументИС"));
		НовыйДок.Вставить("СтатусИС", get_prop(Док, "СтатусИС"));
		НовыйДок.Вставить("Дата", ПреобразоватьСтрокуВДату("dd.MM.yyyy", get_prop(Док, "Дата")));
		НовыйДок.Вставить("Номер", get_prop(Док, "Номер"));
		
		Ответственный = get_prop(Док, "Ответственный");
		НовыйДок.Вставить("Ответственный", СокрЛП("" + get_prop(Ответственный, "Фамилия") + " "
											  + get_prop(Ответственный, "Имя") + " "
											  + get_prop(Ответственный, "Отчество") + " "));
		
		НовыйДок.Вставить("Сумма", get_prop(Док, "Сумма"));
		
		НашаОрганизация = get_prop(Док, "НашаОрганизация");
		СвЮЛ = get_prop(НашаОрганизация, "СвЮЛ");
		Если СвЮЛ <> Неопределено Тогда
			Организация = get_prop(СвЮЛ, "Название");
		Иначе
			СвФЛ = get_prop(НашаОрганизация, "СвФЛ");
			Организация = get_prop(СвФЛ, "НазваниеПолное");
		КонецЕсли;
		НовыйДок.Вставить("Организация", Организация);
		
		НашКонтрагент = get_prop(Док, "Контрагент");
		СвЮЛ = get_prop(НашКонтрагент, "СвЮЛ");
		Если СвЮЛ <> Неопределено Тогда
			Контрагент = get_prop(СвЮЛ, "Название");
		Иначе
			СвФЛ = get_prop(НашКонтрагент, "СвФЛ");
			Контрагент = get_prop(СвФЛ, "НазваниеПолное");
		КонецЕсли;
		НовыйДок.Вставить("Контрагент", Контрагент);
		
		Реестр.Добавить(НовыйДок);
	КонецЦикла;
	
	result.Вставить("Документ", Реестр);
	result.Вставить("Pagination", Новый Соответствие); // Обогащаем
	result["Pagination"].Вставить("HasMore", get_prop(result["Навигация"], "ЕстьЕще") = "Да");
	
	Возврат result;
КонецФункции

// Функция block_saby_query_calc_value
//
// Параметры:
//  block_type - Строка - Название блока
// 	node - Структура - Dom структура хмл
//  path - Строка - Пусть до блока по алгоритму
//  context - Структура - Общий контекст алгоритма
//  block_context - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Произвольное - Результат обсчета алгоритма
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:UnusedLocalVariable-off
// BSLLS:FunctionShouldHaveReturn-off
// BSLLS:MissingParameterDescription-off
//DynamicDirective
Функция block_saby_query_calc_value(block_type, node, path, context, block_context)
	Если get_prop(block_context, "filter") <> Неопределено Тогда
		block_context["filter"].Вставить("Тип", block_context["type"]);
	Иначе
		block_context.Вставить("filter", Новый Соответствие);
		block_context["filter"].Вставить("Тип", block_context["type"]);
	КонецЕсли;
	block_context["filter"].Вставить("Навигация", Новый Соответствие);
	Если get_prop(block_context, "limit") <> Неопределено Тогда
		block_context["filter"]["Навигация"].Вставить("РазмерСтраницы", block_context["limit"]);
	КонецЕсли;
	Если get_prop(block_context, "offset") <> Неопределено Тогда
		block_context["filter"]["Навигация"].Вставить("Страница", block_context["offset"]);
	КонецЕсли;
	ДопПоляАддон = Ложь;
	ДопПоля = get_prop(block_context["filter"], "ДопПоля");
	Если ТипЗнч(ДопПоля) = Тип("Массив") Тогда
		Если ДопПоля.Найти("Addon") <> Неопределено Тогда
			ДопПоляАддон = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ДопПоляАддон Тогда
		result = ТранспортИнтеграции.local_helper_document_list(context.params, block_context["filter"]);
	Иначе
		Фильтр = ЗаполнениеФильтраСпискаДокументовИзФильтраАддона(block_context["filter"]);
		result = ТранспортИнтеграции.local_helper_document_list(context.params, Фильтр);
		result = ДополнитьПоляРеестра(result, context);
	КонецЕсли;
	Возврат result;
КонецФункции
// BSLLS:UnusedLocalVariable-on
// BSLLS:FunctionShouldHaveReturn-on
// BSLLS:MissingParameterDescription-on

