
// Функция block_text_multiline_execute
//
// Параметры:
//  block_type - Строка - Название блока
// 	node - Структура - Dom структура хмл
//  path - Строка - Пусть до блока по алгоритму
//  context - Структура - Общий контекст алгоритма
//  block_context - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Строка - Результат обсчета алгоритма
//DynamicDirective
Функция block_text_multiline_execute(block_type, node, path, context, block_context)
	
	Возврат СтрЗаменить(node.ПервыйДочерний.ТекстовоеСодержимое, "&#10;", Символы.ПС);
КонецФункции

