
// Поиск в массиве по значению
//
// Параметры:
//  items - Массив - Массив
//  value - Произвольное - Искомое значение
//  field - Строка - Поле поиска
//
// Возвращаемое значение:
//  Произвольное - Результат обсчета алгоритма
//
//DynamicDirective
Функция ArrayHelper_find(items, value, field = "id")
	Для i = 0 по items.Количество() - 1 Цикл
		Если items[i][field] = value Тогда
			Возврат i;
		КонецЕсли;	
	КонецЦикла;	
	Возврат items.Количество() - 1;
КонецФункции	

//DynamicDirective

Функция Saby_КопияМассива(Массив, НачальныйИндекс = Неопределено, КонечныйИндекс = Неопределено)
	сз = Новый СписокЗначений;
	сз.ЗагрузитьЗначения(Массив);
	МассивКопия = сз.ВыгрузитьЗначения();
	ИндексС = НачальныйИндекс;
	ИндексПо = КонечныйИндекс;
	Если ИндексС = Неопределено И ИндексПо = Неопределено Тогда
		Возврат МассивКопия;
	КонецЕсли;     
	Если ИндексС = Неопределено Тогда 
		ИндексС = 0;	
	КонецЕсли;	
	Если ИндексПо = Неопределено Тогда 
		ИндексПо = МассивКопия.Количество()-1;	
	КонецЕсли;	
	ИтоговыйМассив = Новый Массив;
	Для Сч = ИндексС По ИндексПо Цикл 
		ИтоговыйМассив.Добавить(МассивКопия.Получить(Сч));	
	КонецЦикла;	
	Возврат ИтоговыйМассив; 
КонецФункции	

//DynamicDirective

Функция Saby_КопияСтруктуры(Источник) 
	Итог = Новый Структура;
	Для каждого Поле из Источник цикл
		Итог.Вставить(Поле.Ключ, Поле.Значение);
	КонецЦикла;
	Возврат Итог; 
КонецФункции
