
//DynamicDirective

Функция get_prop_onserver(_obj, elem)
	Результат = get_prop(_obj, elem);
	Если ЭтоТипТабличнаяЧасть(Результат) Тогда
		Результат = ПреобразоватьТаблицуЗначенийВМассивСтруктур(Результат.Выгрузить());
	КонецЕсли;
	Возврат Результат;	
КонецФункции

//DynamicDirective

Функция ЭтоТипТабличнаяЧасть(ПроверяемоеЗнч)
	ПроверяемоеЗнчСтрокой = Строка(ПроверяемоеЗнч);
	Возврат ((Найти(ПроверяемоеЗнчСтрокой, "ДокументТабличнаяЧасть.") > 0)
				ИЛИ
			(Найти(ПроверяемоеЗнчСтрокой, "СправочникТабличнаяЧасть.") > 0));
КонецФункции

//DynamicDirective

Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(п_ТЗ) Экспорт
	
	Массив = Новый Массив();
	
	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;
	
	Для Каждого Колонка Из п_ТЗ.Колонки Цикл
		
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая     = Истина;
		
	КонецЦикла;
	
	Для Каждого Строка Из п_ТЗ Цикл
		
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Массив.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции 
