
// Процедура НавигацияВСобытияхСаби
//
// Параметры:
// 	ЕстьЕще - Строка - Есть еще страницы
// 	block_context - Структура - Контекст блока
// 	Навигация - Неопределено - Навигация
//
//DynamicDirective
Процедура НавигацияВСобытияхСаби(ЕстьЕще, block_context, Навигация = Неопределено)
	Навигация = get_prop(block_context.filter, "Навигация");
	Если Навигация = Неопределено Тогда
		Навигация = Новый Структура("РазмерСтраницы", 25);
	КонецЕсли;
	
	Если Не block_context.Свойство("ONEPAGE") и get_prop(Навигация, "Страница") <> Неопределено Тогда
		block_context.Вставить("ONEPAGE", Истина);
	ИначеЕсли Не block_context.Свойство("ONEPAGE") и get_prop(Навигация, "Страница") = Неопределено Тогда 
		block_context.Вставить("ONEPAGE", Ложь);	
	Иначе
		block_context.Вставить("ONEPAGE", Ложь);
	КонецЕсли;	
КонецПроцедуры

// Функция ОбработкаСобытийСаби
//
// Параметры:
// 	ЭлементРеестра - Строка - Элемент из ответа метода БЛ
// 	МетодСаби - Строка - Название метода БЛ
// 	ЕстьЕщеВнешний - Строка - Есть еще страницы
// 	Навигация - Неопределено - Навигация
// 	node - Структура - Дом структура алгоритма
// 	path - Строка - Путь до блока
// 	context - Структура - Общий контекст
// 	block_context - Структура - Контекст блока
//
// Возвращаемое значение:
//  - Неопределено, Произвольный - Результат работы блока
//
//DynamicDirective
Функция ОбработкаСобытийСаби(ЭлементРеестра, МетодСаби, ЕстьЕщеВнешний, Навигация, node, path, context, block_context)
	ЕстьЕще = ЕстьЕщеВнешний;
	Пока ЕстьЕще = "Да" Цикл
		Если Не block_context.Свойство("INDEX") Тогда
			block_context.Вставить("INDEX", 0);		
		КонецЕсли;
		
		block_context.filter.Вставить("Навигация", Навигация);
		Если МетодСаби = "SabyDocumentList" Тогда	
			result = ТранспортИнтеграции.local_helper_document_list(context.params, block_context.filter);
		ИначеЕсли МетодСаби = "SabyDocumentEventList" Тогда
			result = ТранспортИнтеграции.local_helper_document_event_list(context.params, block_context.filter);
		Иначе
			result = Неопределено;
		КонецЕсли;	
		
		Список = result[ЭлементРеестра];
	
		Пока block_context["INDEX"] < Список.Количество() Цикл
			ДочернийУзел = get_statement_node(node);
			Список[block_context["INDEX"]].Вставить("Навигация", result["Навигация"]);
			add_param_api3(Список[block_context["INDEX"]], context);	
			block_set_variable(context, block_context["NAME"], Список[block_context["INDEX"]]);
			block_execute_all_next(ДочернийУзел, path, context, block_context, True);
			block_context["INDEX"] = block_context["INDEX"] + 1;
		КонецЦикла;
		
		block_context["INDEX"] = 0;
		ЕстьЕще = result["Навигация"]["ЕстьЕще"];
		block_context["filter"]["Навигация"].Вставить("Страница", Число(result["Навигация"]["Страница"]) + 1);
		Если block_context["ONEPAGE"] Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат Неопределено;	
КонецФункции

//DynamicDirective

Процедура add_param_api3(obj, context)	
	Если get_prop(obj, "ИдСБИС") <> Неопределено 
		И get_prop(obj, "ИмяСБИС") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдСБИС = get_prop(obj, "ПервичныйКлюч");
	Если ИдСБИС <> Неопределено Тогда
		obj.Вставить("ИдСБИС", ИдСБИС);
	КонецЕсли;
	ИмяСБИС = get_prop(obj, "Тип");
	Если ИмяСБИС <> Неопределено Тогда 
		Примечание = get_prop(obj, "Примечание");
		ИдентификаторДокумента = get_prop(obj, "Идентификатор"); 
		ИмяСБИС = ТипОбъектаАПИПоТипуСБИС(ИмяСБИС, Примечание, ИдентификаторДокумента, context.params); 
		obj.Вставить("ИмяСБИС", ИмяСБИС);
	КонецЕсли; 
КонецПроцедуры
