
Процедура ЗаписьЖурналаРегистрацииНаСервере(ИмяСобытия, Данные, Комментарий)
	ЗаписьЖурналаРегистрации(ИмяСобытия, , , Данные, Комментарий);	
КонецПроцедуры

// Создает запись в журнал о выполняемых событиях
//
// Параметры:
//  Идентификатор - строка - уникальный идентификатор команды 
//  ПараметрыВыполненияКоманды - структура - дополнительные параметры
//
//DynamicDirective
Процедура ВыполнитьКоманду(Идентификатор, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если Идентификатор = "АвтоматическиеОперации" Тогда
		ВыполнитьАвтоматическиеОперации();
		Возврат;
	КонецЕсли;
	
	_Событие = " Событие";
	_Данные = " Данные";
	_Это = "Это ";

	ЗаписьЖурналаРегистрацииНаСервере(
		_Это + ЛокализацияНазваниеПродукта() + _Событие,
		ЛокализацияНазваниеПродукта() + _Данные,
		ЛокализацияНазваниеПродукта() + " ФЗ начало");
	Попытка	
		ПрочитатьСессиюОтладки();
		
		ОбщиеПараметры = get_prop(context.params,"public", Новый Структура);
		
		// Обновление статусов
		Если get_prop(ОбщиеПараметры, "refresh_statuses") = Истина Тогда 
			ЗаписьЖурналаРегистрацииНаСервере(
				_Это + ЛокализацияНазваниеПродукта() + _Событие,
				ЛокализацияНазваниеПродукта() + _Данные,
				ЛокализацияНазваниеПродукта() + " ФЗ Обновление статусов началось");
			
			ПараметрыВызова	= Новый Соответствие();
			ПараметрыВызова.Вставить("params", context.params );
			ПараметрыВызова.Вставить("CommandsResult",Новый Массив);
			ПараметрыВызова.Вставить("Endpoint","");
			ПараметрыВызова.Вставить("ContextId", Неопределено);
			ПараметрыВызова.Вставить("Algorithm","ОбновитьСтатусы_send");
			ConnectionId	= Неопределено;
			context.params.Свойство("ConnectionId", ConnectionId);
			ПараметрыВызова.Вставить("ConnectionId", ConnectionId);
			ПараметрыВызова.Вставить("object",Новый Соответствие());
			
			Результат = API_BLOCKLY_RUN(ПараметрыВызова);
			Если Результат["Status"] = "complete" Тогда
					ЗаписьЖурналаРегистрацииНаСервере(
						_Это + ЛокализацияНазваниеПродукта() + _Событие,
						ЛокализацияНазваниеПродукта() + _Данные,
						ЛокализацияНазваниеПродукта() + " ФЗ Обновление статусов выполнено успешно");
			Иначе
				ЗаписьЖурналаРегистрацииНаСервере(
					_Это + ЛокализацияНазваниеПродукта() + _Событие,
					ЛокализацияНазваниеПродукта() + _Данные,
					ЛокализацияНазваниеПродукта() + " ФЗ Обновление статусов завершено с ошибкой");
			КонецЕсли	
		КонецЕсли;	
		// Обновление статусов
		
		ЗаписьЖурналаРегистрацииНаСервере(
			_Это + ЛокализацияНазваниеПродукта() + _Событие,
			ЛокализацияНазваниеПродукта() + _Данные,
			ЛокализацияНазваниеПродукта() + " ФЗ выполнено");
	Исключение
		// ИнфОбОшибке = ИнформацияОбОшибке();
		// ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		ЗаписьЖурналаРегистрацииНаСервере(
			_Это + ЛокализацияНазваниеПродукта() + _Событие,
			ЛокализацияНазваниеПродукта() + _Данные,
			ЛокализацияНазваниеПродукта() + " ФЗ ошибка");
	КонецПопытки;
КонецПроцедуры
		
// Обновляет или записывает новый алгоритм в память 1С
//
// Параметры:
//  ПараметрыВызова - Структура - параметры с информацией об алгоритме, его названии и хмл строкой-содержимым
//               
// Возвращаемое значение:
//  - Неопределено - Не требуется. Фактически это должно быть процедурой. В угоду единообразия с питоном остается так
//
//DynamicDirective
Функция API_BLOCKLY_UPDATE_INI(ПараметрыВызова) Экспорт
	ПрочитатьСессиюОтладки();
	ПриЗапускеРобота(ПараметрыВызова);
	IniUpdate(ПараметрыВызова);
	Возврат Неопределено;
КонецФункции

// Запускает обсчет алгоритма, той части, что на сервере
//
// Параметры:
//  ПараметрыВызова - Структура - параметры с информацией об алгоритме, его названии и хмл строкой-содержимым и параметры вызова
//               
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
Функция API_BLOCKLY_RUN_SERVER(ПараметрыВызова)
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.API_BLOCKLY_RUN(ПараметрыВызова);
КонецФункции

// Запускает обсчет алгоритма
//
// Параметры:
//  ПараметрыВызова - Структура - параметры с информацией об алгоритме, его названии и хмл строкой-содержимым и параметры вызова
//               
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
//DynamicDirective
Функция API_BLOCKLY_RUN(ПараметрыВызова) Экспорт
	ТипТранспортаСервер = ТранспортИнтеграции.ЭтоСервер();
	Если ТипТранспортаСервер = Истина Тогда
		Результат = API_BLOCKLY_RUN_SERVER(ПараметрыВызова); 
		Возврат Результат;
	КонецЕсли;
	Попытка
		ПрочитатьСессиюОтладки();
		ПриЗапускеРобота(ПараметрыВызова);
		Результат = ExternalCalcIni(ПараметрыВызова); // Если complete или error то 		
		Возврат Результат;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Возврат Новый структура("Result, Status", ОшибкаСтруктура, "error");
	КонецПопытки;
КонецФункции

// Запускает обсчет алгоритма
//
// Параметры:
//  ПараметрыВызова - Структура - параметры с информацией об алгоритме, его названии и хмл строкой-содержимым и параметры вызова
//  Адрес - Неопределено - атовизм. надо удалить. deprecated
//
//DynamicDirective
Процедура API_BLOCKLY_RUN_BACKGROUND(ПараметрыВызова, Адрес) Экспорт
	// Результат загрузки ини файла
	Символов4 = 4;
	_algorithm = "Algorithm";
	Попытка
		XMLИниФайл	= Load_ini( ПараметрыВызова[_algorithm], ПараметрыВызова );
		Если ТипЗнч(XMLИниФайл) = Тип("Строка") И Врег(Лев(XMLИниФайл, Символов4)) = "<XML"  Тогда
			_data = Новый Структура("detail, message", ПараметрыВызова[_algorithm], "ИНИ успешно получен");
			Результат = Новый Структура("status, data, LoadIni",
				"complete", 
				_data);
			// Результат пердачи объектов, только в случае успешного получения ини файла
			Результат = API_BLOCKLY_RUN(ПараметрыВызова);
		Иначе
			_data = Новый Структура("detail, message", ПараметрыВызова[_algorithm], XMLИниФайл);
			Результат = Новый Структура("Status, Result, LoadIni",
				"error", 
				_data);
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Ошибка = ExtExceptionAnalyse(ИнфОбОшибке);
		Результат = Новый структура("Result, Status", Ошибка, "error");		
	КонецПопытки;  
	
	СообщитьПрогресс(, , Результат);
КонецПроцедуры 

// Запускает обсчет алгоритма
//
// Параметры:
//  ПараметрыВызова - Структура - параметры с информацией об алгоритме, его названии и хмл строкой-содержимым и параметры вызова
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
//DynamicDirective
Функция API_BLOCKLY_COMMANDS(ПараметрыВызова) Экспорт
	ПрочитатьСессиюОтладки();
	ПриЗапускеРобота(ПараметрыВызова);
	Результат = ОбработатьКоманды(ПараметрыВызова);
	Возврат Результат;
КонецФункции

Функция API_DOCUMENT_READ_STATUS(ПараметрыВызова) Экспорт
	ТаблицаИдентификаторов = ТаблицаИдентификаторовДокументовИнтеграции(ПараметрыВызова);
	Возврат СтатусыДокументовПолучитьСостоянияОбъектов(ТаблицаИдентификаторов);
КонецФункции 

Функция ТаблицаИдентификаторовДокументовИнтеграции(СписокДокументовИнтеграции)
	tUID = Новый ТаблицаЗначений;
	tUID.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
	Для Каждого ДокументИнтеграции Из СписокДокументовИнтеграции Цикл
		НовСтрока = tUID.Добавить();
		UID = get_prop(ДокументИнтеграции, "Uuid", get_prop(ДокументИнтеграции, "Id"));
		// TODO удаить ИдИС когда UID до онлайна доедет
		НовСтрока.UID = Формат(UID, "ЧГ=0");
	КонецЦикла;
	Возврат tUID; 
КонецФункции
