
Функция API_ROBOT_RUN(ПараметрыВызова) Экспорт
	ПараметрыВызова.Параметры.Свойство("ИдСессии", ИдентификаторСессии);
	ПриЗапускеРобота(ПараметрыВызова);
	Если ПараметрыРобота = Неопределено Тогда
		ПараметрыРобота = ПараметрыВызова["Параметры"];
	КонецЕсли;
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("connection_uuid", ПараметрыВызова["connection_uuid"]);
	ПараметрыЗапроса.Вставить("operation_uuid", Неопределено);
	ПараметрыЗапроса.Вставить("algorithm", ПараметрыВызова["algorithm"]);
	ПараметрыЗапроса.Вставить("commands_result", Новый Массив);
	ПараметрыЗапроса.Вставить("endpoint", ПараметрыВызова["endpoint"]);
	Пока Истина Цикл
		РезультатЗапроса = IntegrationRobotRun(ПараметрыЗапроса);
		Если РезультатЗапроса["status"] <> "run"  Тогда
			Если РезультатЗапроса["status"] = "error" Тогда
				ВызватьИсключение РезультатЗапроса["data"];	
			КонецЕсли;
			Возврат РезультатЗапроса["data"];
		КонецЕсли;
		ПараметрыЗапроса["operation_uuid"] = РезультатЗапроса["operation_uuid"];
		ПараметрыЗапроса["commands_result"] = ОбработатьКоманды(РезультатЗапроса["commands"]);
		
	КонецЦикла;		
КонецФункции

Функция IntegrationRobotRun(ПараметрыВызова)
	Соединение = ПолучитьHTTPСоединение(Ложь, ПараметрыРобота["host"]);
	АдресРесурса = ПараметрыРобота["path"];
	Запрос = Новый Структура();
	Запрос.Вставить("connection_uuid", ПараметрыВызова["connection_uuid"]);
	Запрос.Вставить("algorithm", ПараметрыВызова["algorithm"]);
	Запрос.Вставить("operation_uuid", ПараметрыВызова["operation_uuid"]);
	Запрос.Вставить("commands_result", ПараметрыВызова["commands_result"]);
	Запрос.Вставить("endpoint", ПараметрыВызова["endpoint"]);
	СтрокаТелаЗапроса = encode_xdto_xml(Запрос);
	ЗапросСервису = Новый HTTPЗапрос(АдресРесурса, СформироватьЗаголовкиЗапроса());
	Если СтрокаТелаЗапроса <> "" Тогда
		ЗапросСервису.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);
	КонецЕсли;
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(ЗапросСервису);
	Исключение
		ИнфОбОшибке = ОписаниеОшибки();
		Возврат ExtExceptionAnalyse(ИнфОбОшибке);
	КонецПопытки;	
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	РезультатЗапроса = decode_xml_xdto(СтрокаОтвета);
	Возврат РезультатЗапроса;
КонецФункции
