
#Область ВыполнитьКоманды_Клиент

// ВыполнитьКоманды Клиент
//
// Параметры:
//  ОбработчикРезультата - ОписаниеОповещения - Метод обработки результата
//  actions - Структура - Команда
//  commands_data - Строка - Даные команды
//
&НаКлиенте
Процедура ВыполнитьКоманды_Клиент(ОбработчикРезультата, actions, commands_data) Экспорт
	commands_result = Новый Массив;
	Результат_commands_data = ПолучитьИзВременногоХранилища(commands_data);
	Если commands_data <> Неопределено Тогда
		УдалитьИзВременногоХранилища(commands_data);
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Commands", actions);
	Контекст.Вставить("CommandsData", Результат_commands_data);
	Контекст.Вставить("CommandsResult", commands_result);
	
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	Контекст.Вставить("ТекИндекс", -1);
	Контекст.Вставить("Количество", actions.Количество());
	
	ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
КонецПроцедуры

// ВыполнитьКоманды КлиентЦиклНачало
//
// Параметры:
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентЦиклНачало(Контекст)
	Контекст.ТекИндекс = Контекст.ТекИндекс + 1;
	Если Контекст.ТекИндекс < Контекст.Количество Тогда
		ВыполнитьКоманды_КлиентОбработкаКоманды(Контекст);
	Иначе
		ВыполнитьКоманды_КлиентЗавершение(Контекст);
	КонецЕсли;
КонецПроцедуры

// ВыполнитьКоманды_КлиентОбработкаКоманды
//
// Параметры:
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентОбработкаКоманды(Контекст)
	
	commands_data = Контекст.CommandsData;
	commands_result = Контекст.CommandsResult;
	
	action = Контекст.Commands[Контекст.ТекИндекс];
	Если action.name = "Подписать" Тогда
		ОбработчикРезультата = Новый ОписаниеОповещения("ВыполнитьКоманды_КлиентПослеПодписания", МодульФоновогоЗаданияКлиент(), Контекст);
		Подписать(ОбработчикРезультата, action.params.СертификатДляПодписания, commands_data.Получить(action.uuid));	
	ИначеЕсли action.name = "ВыполнитьвОС" Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off
		// запуск производится из разных местиспользовать НачатьЗапускПриложения не получится
		ЗапуститьПриложение(action.params); 
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(action.params);	
		#КонецЕсли
		command_result = Новый Структура("uuid, status, result", action.uuid, "complete", Истина);
		Контекст.CommandsResult.Добавить(command_result);
		ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
	ИначеЕсли action.name = "ВвестиПарольСертификата" Тогда	
		Отпечаток = get_prop(action.params, "Отпечаток");
		pass_cert = get_prop(Контекст, "pass_cert");
		ПарольСертификата = Неопределено;
		Если pass_cert <> Неопределено Тогда
			ПарольСертификата = get_prop(pass_cert, Отпечаток); 
		КонецЕсли;	
		Если ПарольСертификата = Неопределено Тогда
			ОбработчикРезультата = Новый ОписаниеОповещения("ВыполнитьКоманды_КлиентПослеВводаПароля", МодульФоновогоЗаданияКлиент(), Контекст);
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Введите пароль сертификата"); 
			ТекстРасшифровки = Строка(get_prop(action.params, "ИмяСертификата", "")) + "(" + get_prop(action.params, "Действие", "") + ")";
			ПараметрыФормы.Вставить("РасшифровкаВводаПароля", ТекстРасшифровки);
			ОткрытьФормуОбработки("ВводПароля", ПараметрыФормы, Неопределено, , ОбработчикРезультата, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Иначе	
			command_result = Новый Структура("uuid, status, result", action.uuid, "complete", ПарольСертификата);
			commands_result.Добавить(command_result);
			ВыполнитьКоманды_КлиентЦиклНачало(Контекст);	
		КонецЕсли;			
	Иначе
		command_result = Новый Структура("uuid, status, result", action.uuid, "error", "Неизвестная команда = '" + action.name + "'");
		commands_result.Добавить(command_result);
		ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// ВыполнитьКоманды_КлиентПослеПодписания
//
// Параметры:
//  РезультатПодписания - Структура - Название блока
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентПослеПодписания(РезультатПодписания, Контекст) Экспорт
	action = Контекст.Commands[Контекст.ТекИндекс];
	
	// Обработка ошибки
	Если ТипЗнч(РезультатПодписания) = Тип("Структура")
		И РезультатПодписания.Свойство("БылаОшибка") = Истина
		И РезультатПодписания.БылаОшибка = Истина Тогда
		
		command_result = Новый Структура("uuid, status, result", action.uuid, "error", РезультатПодписания.ИнформацияОбОшибке);
		
	// Нормальные данные
	Иначе
		command_result = Новый Структура("uuid, status, result", action.uuid, "complete", РезультатПодписания);
	КонецЕсли;
	Контекст.CommandsResult.Добавить(command_result);
	
	ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманды_КлиентПослеВводаПароля(Результат, Контекст) Экспорт
	action = Контекст.Commands[Контекст.ТекИндекс];
	Отпечаток = get_prop(action.params, "Отпечаток");
	ПарольПользователя = Новый Структура;
	Если Результат = Неопределено Тогда
		ПарольПользователя.Вставить("InputStatus", "ОтменаВводаПароля");
	Иначе
		ПарольПользователя.Вставить("InputStatus", "ВведенПароль");
		ПарольПользователя.Вставить("password", Результат);
	КонецЕсли;
	command_result = Новый Структура("uuid, status, result", action.uuid, "complete", ПарольПользователя);
	Контекст.CommandsResult.Добавить(command_result);
	pass_cert = get_prop(Контекст, "pass_cert", Новый Соответствие);
	pass_cert.Вставить(Отпечаток, ПарольПользователя);
    Контекст.Вставить("pass_cert", pass_cert); 
	ВыполнитьКоманды_КлиентЦиклНачало(Контекст);	
КонецПроцедуры

// Процедура ВыполнитьКоманды_КлиентЗавершение
//
// Параметры:
//  Контекст - Форма - Форма приложения
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентЗавершение(Контекст)
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Контекст.CommandsResult);
	
КонецПроцедуры

#КонецОбласти
