
#Область ВыполнитьКоманды_Клиент

// ВыполнитьКоманды Клиент
//
// Параметры:
//  ОбработчикРезультата - ОписаниеОповещения - Метод обработки результата
//  commands - Структура - Команда
//  commands_data - Строка - Даные команды
//
&НаКлиенте
Процедура ВыполнитьКоманды_Клиент(ОбработчикРезультата, commands, commands_data) Экспорт
	commands_result = Новый Массив;
	Результат_commands_data = ПолучитьИзВременногоХранилища(commands_data);
	Если commands_data <> Неопределено Тогда
		УдалитьИзВременногоХранилища(commands_data);
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("commands", commands);
	Контекст.Вставить("commands_data", Результат_commands_data);
	Контекст.Вставить("commands_result", commands_result);
	
	Контекст.Вставить("ОбработчикРезультата", ОбработчикРезультата);
	
	Контекст.Вставить("ТекИндекс", -1);
	Контекст.Вставить("Количество", commands.Количество());
	
	ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
КонецПроцедуры

// ВыполнитьКоманды КлиентЦиклНачало
//
// Параметры:
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентЦиклНачало(Контекст)
	Контекст.ТекИндекс = Контекст.ТекИндекс + 1;
	Если Контекст.ТекИндекс < Контекст.Количество Тогда
		ВыполнитьКоманды_КлиентОбработкаКоманды(Контекст);
	Иначе
		ВыполнитьКоманды_КлиентЗавершение(Контекст);
	КонецЕсли;
КонецПроцедуры

// ВыполнитьКоманды_КлиентОбработкаКоманды
//
// Параметры:
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентОбработкаКоманды(Контекст)
	
	commands_data = Контекст.commands_data;
	commands_result = Контекст.commands_result;
	
	command = Контекст.commands[Контекст.ТекИндекс];
	Если command.name = "Подписать" Тогда
		ОбработчикРезультата = Новый ОписаниеОповещения("ВыполнитьКоманды_КлиентПослеПодписания", МодульФоновогоЗаданияКлиент(), Контекст);
		Подписать(ОбработчикРезультата, command.params.СертификатДляПодписания, commands_data.Получить(command.uuid));	
	ИначеЕсли command.name = "ВыполнитьвОС" Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда 
		// BSLLS:UsingSynchronousCalls-off
		// запуск производится из разных местиспользовать НачатьЗапускПриложения не получится
		ЗапуститьПриложение(command.params); 
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(command.params);	
		#КонецЕсли
		command_result = Новый Структура("uuid, status, result", command.uuid, "complete", Истина);
		Контекст.commands_result.Добавить(command_result);
		ВыполнитьКоманды_КлиентЦиклНачало(Контекст);	
	Иначе
		command_result = Новый Структура("uuid, status, result", command.uuid, "error", "Неизвестная команда = '" + command.name + "'");
		commands_result.Добавить(command_result);
		ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
	КонецЕсли;
	
КонецПроцедуры

// ВыполнитьКоманды_КлиентПослеПодписания
//
// Параметры:
//  РезультатПодписания - Структура - Название блока
//  Контекст - Форма - Форма приложения
//
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентПослеПодписания(РезультатПодписания, Контекст) Экспорт
	command = Контекст.commands[Контекст.ТекИндекс];
	
	// Обработка ошибки
	Если ТипЗнч(РезультатПодписания) = Тип("Структура")
		И РезультатПодписания.Свойство("БылаОшибка") = Истина
		И РезультатПодписания.БылаОшибка = Истина Тогда
		
		command_result = Новый Структура("uuid, status, result", command.uuid, "error", РезультатПодписания.ИнформацияОбОшибке);
		
	// Нормальные данные
	Иначе
		command_result = Новый Структура("uuid, status, result", command.uuid, "complete", РезультатПодписания);
	КонецЕсли;
	Контекст.commands_result.Добавить(command_result);
	
	ВыполнитьКоманды_КлиентЦиклНачало(Контекст);
КонецПроцедуры

// Процедура ВыполнитьКоманды_КлиентЗавершение
//
// Параметры:
//  Контекст - Форма - Форма приложения
&НаКлиенте
Процедура ВыполнитьКоманды_КлиентЗавершение(Контекст)
	
	ВыполнитьОбработкуОповещения(Контекст.ОбработчикРезультата, Контекст.commands_result);
	
КонецПроцедуры

#КонецОбласти
