
Функция add_block_to_dump_onserver(block_context, dump = Неопределено)
	_dump = dump;
	Если _dump = Неопределено Тогда
		_dump = Новый Структура("block_id, block_type, block_path", block_context.__id, block_context.__type, block_context.__path);
	Иначе
		ВставитьСвойствоЕслиНет(_dump, "block_id", block_context.__id);
		ВставитьСвойствоЕслиНет(_dump, "block_type", block_context.__type);
		ВставитьСвойствоЕслиНет(_dump, "block_path", block_context.__path);
	КонецЕсли;
	Возврат _dump;
КонецФункции

// block_obj_get_path_value
//
// Параметры:
//  obj - Структура - обрабатываемый объект
//  obj_path - Строка - Путь внутри объекта
//  obj_name - Строка - Имя объекта
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
//DynamicDirective
Функция block_obj_get_path_value(Знач obj, obj_path, obj_name)  Экспорт
	delimiter = ".";
	_path = СтрРазделить82(obj_path, delimiter, Ложь);
	_obj = obj;
	
	i = 0;
	size = _path.Количество();
	Пока i < size Цикл
		РезультатЗначения = ПроверкаЗначения(_obj, size, i, _path, obj_path, obj_name, obj);
		Если РезультатЗначения = -1 Тогда 
			Возврат Неопределено;
		КонецЕсли;	
		Если _obj = Неопределено Тогда
			Прервать;
		КонецЕсли;	
		i = i + 1;
	КонецЦикла;	
	Возврат _obj;
КонецФункции

//DynamicDirective
Функция ПроверкаЗначения(_obj, size, i, _path, obj_path, obj_name, obj) 
	ЭтоМассив = ПроверитьНаТипМассив(_obj);
	elem = _path[i];
		
	Если ЭтоМассив = Истина Тогда
		Попытка  // это число
			// BSLLS:TryNumber-off
			// Отказаться нельзя т.к. при приведении к числу мы получим знч по умолчанию типа число, и проверка не получится
			_obj = _obj[Число(elem)];
			// BSLLS:TryNumber-on
		Исключение
			Если (i < size - 1) Тогда
				index = ArrayHelper_find(_obj, _path[i + 1], elem);
			Иначе
				index = -1;
			КонецЕсли;
			Если index >= 0 Тогда
				_obj = _obj[index];
				i = i + 1;
			Иначе
				Возврат -1;
			КонецЕсли;
		КонецПопытки;	
	Иначе
		Попытка
			_obj = get_prop(_obj, elem);
		Исключение	
			ВызватьИсключение NewExtExceptionСтрока(, "Не удалось получить свойство объекта", "path " + obj_path + " not supported (" + obj_name + ")", "block_obj_get_path_value", obj);
		КонецПопытки;	
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

//DynamicDirective
Функция ПроверитьНаТипМассив(_obj)
	
	Если ТипЗнч(_obj) =  Тип("Массив") Тогда
		Возврат Истина;	
	КонецЕсли;
	#Если Сервер Тогда
		Если ТипЗнч(_obj) =  Тип("ТаблицаЗначений") Тогда
			Возврат Истина;	
		КонецЕсли;
	#КонецЕсли
	Возврат Ложь;
КонецФункции

//DynamicDirective
Процедура block_obj_set_path_value(obj, obj_path, value)  Экспорт
	delimiter = ".";
	_path = СтрРазделить82(obj_path, delimiter, Ложь);
	_obj = obj;
	
	i = 0;
	size = _path.Количество() - 1;
	Пока i < size Цикл
		elem = _path[i];
		sub_obj = get_prop(_obj, elem);
		Если sub_obj = Неопределено Тогда
			_obj.Вставить(elem, Новый Соответствие); 	
		КонецЕсли;
        _obj = get_prop(_obj, elem);
		i = i + 1;
	КонецЦикла;
	_obj.Вставить(_path[size], value);
КонецПроцедуры

Процедура block_obj_append_path_value(obj, obj_path, value)  Экспорт
	delimiter = ".";
	_path = СтрРазделить82(obj_path, delimiter, Ложь);
	_obj = obj;
	
	i = 0;
	size = _path.Количество() - 1;
	Пока i <= size Цикл
		elem = _path[i];
		sub_obj = get_prop(_obj, elem); 
		НовыйЭлемент = Новый Соответствие;
		Если i = size Тогда 
			НовыйЭлемент = Новый Массив;
		КонецЕсли;	
		Если sub_obj = Неопределено Тогда 
			_obj.Вставить(elem, НовыйЭлемент); 	
		КонецЕсли;
        _obj = get_prop(_obj, elem);
		i = i + 1;
	КонецЦикла;
		
	Если Найти(Строка(_obj), "ТабличнаяЧасть") = 0 И Найти(Строка(_obj), "ТаблицаЗначений") = 0 Тогда  
		Попытка
			_obj.Добавить(value);
		Исключение   
			Текст = "Объект не является списочным типом. Текущий тип объекта: " + ТипЗнч(_obj);
			ВызватьИсключение Текст; 
		КонецПопытки;
		Возврат;
	КонецЕсли;
	_variable = _obj.Добавить();
	Если ТипЗнч(value) <> Тип("Структура") И ТипЗнч(value) <> Тип("Соответствие") Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого field Из value Цикл
		Попытка
			_variable[field.Ключ] = field.Значение;
		Исключение  
			Продолжить;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ЭтоТипТабличнаяЧасть(ПроверяемоеЗнч)
	ПроверяемоеЗнчСтрокой = Строка(ПроверяемоеЗнч);
	Возврат ((Найти(ПроверяемоеЗнчСтрокой, "ДокументТабличнаяЧасть.") > 0)
				ИЛИ
			(Найти(ПроверяемоеЗнчСтрокой, "СправочникТабличнаяЧасть.") > 0));
КонецФункции

Процедура ПреобразоватьСтруктутуКДопустимымXDTOТипам(Переменные)
		
	Для Каждого Стр Из Переменные Цикл
		
		Если Найти(Строка(Стр.Значение),"ТабличнаяЧастьСтрока") Тогда //И СтрДлина(ТипЗнч(Стр.Значение)) > 6 Тогда
			Переменные[Стр.Ключ] = ПолучитьСтруктуруИзСтрокиТабличнойЧасти(Стр.Значение);					
		КонецЕсли;
		
		Если Найти(НРег(ТипЗнч(Стр.Значение)),"объект") Тогда
			Переменные[Стр.Ключ] = ПолучитьСтруктуруИзОбъекта(Стр.Значение);
		КонецЕсли; 
		
		Если Найти(НРег(get_prop(XMLТипЗнч(Стр.Значение),"ИмяТипа","")),"ref") > 0  Тогда
			Переменные[Стр.Ключ] = ПолучитьСтруктуруИзОбъекта(Стр.Значение);
		КонецЕсли;
		
		Если Строка(Стр.Значение) = "СтрокаТаблицыЗначений" Тогда
			Переменные[Стр.Ключ] = ПолучитьСтруктуруИзСтрокиТаблицыЗначений(Стр.Значение);
		КонецЕсли;	
		
		Если ЭтоТипТабличнаяЧасть(Стр.Значение) Тогда
			Табл = Стр.Значение.Выгрузить();
			Переменные[Стр.Ключ] = ПреобразоватьТаблицуЗначенийВМассивСтруктур(Табл);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьСтруктуруИзОбъекта(знач Объект)
	Структура = Новый Структура();     
	Если Найти(НРег(get_prop(XMLТипЗнч(Объект),"ИмяТипа","")),"enumref") > 0 Тогда 
		Структура.Вставить("Ссылка", Объект);	
		Возврат Структура;
	КонецЕсли;
	СсылкаНаОбъект = get_prop(Объект, "Ссылка", Неопределено);
	Если СсылкаНаОбъект <> Неопределено Тогда 
		API3 = Api3Object(СсылкаНаОбъект, "");
		Структура.Вставить("ИдИС", get_prop(API3, "ИдИС"));
		Структура.Вставить("ИмяИС", get_prop(API3, "ИмяИС"));
	КонецЕсли;
	Для каждого Реквизит из Объект.Метаданные().СтандартныеРеквизиты Цикл
		Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
	КонецЦикла;    
	Для каждого Реквизит из Объект.Метаданные().Реквизиты Цикл
		Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);
	КонецЦикла;
	Для каждого ТабличнаяЧасть из Объект.Метаданные().ТабличныеЧасти Цикл
		МассивЭлементов = Новый Массив;
		Для Каждого Стр ИЗ Объект[ТабличнаяЧасть.Имя].Выгрузить() Цикл
			МассивЭлементов.Добавить(ПолучитьСтруктуруИзСтрокиТаблицыЗначений(Стр));
		КонецЦикла;	
		Структура.Вставить(ТабличнаяЧасть.Имя, МассивЭлементов);
	КонецЦикла;    
	Возврат Структура;
КонецФункции

Функция ПолучитьСтруктуруИзСтрокиТабличнойЧасти(знач Объект)
	Структура = Новый Структура();
	ПозицияТЧ = Найти(Строка(Объект), "ТабличнаяЧастьСтрока");
	СтрокаОбъект= СтрЗаменить(Строка(Объект), "ТабличнаяЧастьСтрока", "");
	ПутьТЧ		= СтрРазделить82(СтрокаОбъект, ".", Ложь);
	Если ПозицияТЧ > 0 Тогда
		ПутьТЧ.Вставить(2, "ТабличныеЧасти");
	КонецЕсли;
	ТЧ = Метаданные;
	НомЭлем = 0;
	Для каждого Элем из ПутьТЧ Цикл
		Элем = ?(Элем = "Документ", "Документы", Элем);
		ТЧ = ТЧ[Элем];
		НомЭлем = НомЭлем + 1;
	КонецЦикла;
	Для каждого Реквизит из ТЧ.Реквизиты Цикл
		Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);	
	КонецЦикла;
	Для каждого Реквизит из ТЧ.СтандартныеРеквизиты Цикл
		Структура.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);	
	КонецЦикла;	
	Возврат Структура;
КонецФункции	

Функция ПолучитьСтруктуруИзСтрокиТаблицыЗначений(знач Объект)
	Структура = Новый Структура;
	Колонки = Объект.Владелец().Колонки;
	Для каждого Колонка Из Колонки Цикл
		Структура.Вставить(Колонка.Имя, Объект[Колонка.Имя]);
	КонецЦикла;	
	Возврат Структура;
КонецФункции	

Функция ПоискОшибокСериализации( Знч, Реквищзит, п3, Отмена ) Экспорт 
	//todoo выпилить функию после реальзации праильного кода. 
	//Функция удаляет все не сериализуемые реквизиты из структуры
	Возврат Неопределено;
КонецФункции

// Вставить Свойство Если Нет
//
// Параметры:
// 	Объект - Структура - Объект
// 	ИмяСвойства - Строка - Имя Свойства
// 	Значение - Произвольный - Значение свойства
//
//DynamicDirective
Процедура ВставитьСвойствоЕслиНет(Объект, ИмяСвойства, Значение)
	Если ТипЗнч(Объект) = Тип("Соответствие") Тогда
		ПроверкаСвойства = ?(Объект[ИмяСвойства] = Неопределено, Ложь, Истина);
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		ПроверкаСвойства = ?(ЗначениеЗаполнено(Объект),Объект.Свойство(ИмяСвойства), Ложь);
	Иначе
		Возврат;
	КонецЕсли;	
	Если ПроверкаСвойства Тогда
		Объект[ИмяСвойства] = Значение;
	Иначе
		Объект.Вставить(ИмяСвойства, Значение);
	КонецЕсли;	
КонецПроцедуры	

Функция ПреобразоватьМассивСтруктурВСоответствие(Мас, ИмяКлюча)
	Результат = Новый Соответствие;
	Если ТипЗнч(Мас) = Тип("Массив") Тогда
		Для Каждого Элем из Мас Цикл
			Результат.Вставить(Элем[ИмяКлюча], Элем);				
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Функция ПрочитатьИзХранилища
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Неопределено, Произвольный - Результат работы метода
//
//TODO Depricated 
Функция ПрочитатьИзХранилища(КлючОбъекта, КлючНастройки = "", ОписаниеНастройки = Неопределено, ПользовательНастройки = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	Возврат ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастройки, ОписаниеНастройки, ПользовательНастройки);
КонецФункции

// Функция ЗаписатьВХранилище
//
// Параметры:
// 	КлючОбъекта - Произвольный - Ключ объекта настройки.
// 	КлючНастройки - Строка - Ключ загружаемых настроек.
// 	Настройки - Произвольный - Настройки пользователя.
// 	ОписаниеНастройки - ОписаниеНастроек - Описание настроек.
// 	ПользовательНастройки -  Строка - Имя пользователя,
//
// Возвращаемое значение:
//  - Булево - Результат работы метода
//
// Все параметры нужны
// BSLLS:NumberOfOptionalParams-off
Функция ЗаписатьВХранилище(КлючОбъекта, КлючНастройки = "", Настройки = Неопределено, ОписаниеНастройки = Неопределено,
 ПользовательНастройки = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастройки, Настройки, ОписаниеНастройки ,ПользовательНастройки);
	Возврат Истина;
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Проверяет наличие обязательных полей структуры по именам
//
// Параметры:
//  СтруктураИсточник - Структура, Соответствие - произвольная структура
//  ИменаКлючей - Строка - строка ключей структуры или соответствия, которые необходимо проверить. Разделитель ","
//  ПерфиксОшибки - Строка - префикс теста ошибки
//
// Возвращаемое значение:
//   Нет.
//
Процедура ПроверитьНаличиеОбязательныхПараметров(СтруктураИсточник, ИменаКлючей, ПерфиксОшибки = "")
	
	МассивИменПараметров = СтрРазделить82(ИменаКлючей,",");
	ТекстПараметров = "";
	Для каждого ИмяПараметра Из МассивИменПараметров Цикл
		Если ТипЗнч(СтруктураИсточник) = Тип("Структура") И НЕ СтруктураИсточник.Свойство(ИмяПараметра) 
			ИЛИ ТипЗнч(СтруктураИсточник) = Тип("Соответствие") И СтруктураИсточник.Получить(ИмяПараметра) = Неопределено Тогда
			
			ТекстПараметров = ТекстПараметров + ИмяПараметра + ", ";
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстПараметров) Тогда
		ТекстПараметров = Лев(ТекстПараметров, СтрДлина(ТекстПараметров)-2);
		ВызватьИсключение(NewExtExceptionСтрока(,"Не заполнены обязательные свойства объекта", ПерфиксОшибки+" ("+ТекстПараметров+")"));
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаличиеОбязательныхПараметров()

Функция helper_find_in_array(data, value, _field)
    i = 0;
    Для Каждого elem из data Цикл
        Попытка
            Если elem[_field] = value тогда
                Возврат i
			КонецЕсли;
		Исключение
			i = i + 1;
            Продолжить;
		КонецПопытки;
		i = i + 1;
	КонецЦикла;
    ВызватьИсключение "";
КонецФункции

Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(п_ТЗ) Экспорт
	
	Массив = Новый Массив();
	
	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;
	
	Для Каждого Колонка Из п_ТЗ.Колонки Цикл
		
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая     = Истина;
		
	КонецЦикла;
	
	Для Каждого Строка Из п_ТЗ Цикл
		
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Массив.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции 

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
Процедура ИнтеграцияДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь)
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция НайтиВМассивеСтруктур
//
// Параметры:
// 	Массив - Массив - Массив
// 	ИскомоеЗначение - Произвольный - Искомое значение
// 	КлючСтруктуры - Произвольный - Ключ Структуры
//
// Возвращаемое значение:
//  - Неопределено, Произвольный - Результат работы метода
//
//DynamicDirective
Функция НайтиВМассивеСтруктур(Массив, ИскомоеЗначение, КлючСтруктуры) Экспорт
	Результат = Неопределено;
	Для Каждого ЭлементМассива Из Массив Цикл 
		Если ЗначениеЗаполнено(Результат) Тогда Прервать; КонецЕсли;
		НайденноеЗначение = get_prop(ЭлементМассива, КлючСтруктуры);	
		Если НайденноеЗначение = ИскомоеЗначение Тогда  
			Результат = ЭлементМассива;
		    Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Результат;
КонецФункции

Функция Api3Object(СсылкаНаОбъект, ИмяСБИС, РазделитьИмяИС = ЛОЖЬ, ini_name = Неопределено, ДобавлятьЗаголовок = Ложь) Экспорт  
	СтруктураОбъекта = Новый Структура("ИдИС, ИмяИС");
	ТипЗначения = ТипЗнч(СсылкаНаОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если ОбъектМетаданных <> Неопределено Тогда
		
		//СтруктураОбъекта.Вставить("ИмяИС", ОбъектМетаданных.Имя);
		
		ТипМетаданных = ПолучитьТипМетаданныхИзОбъектаМетаданных(ОбъектМетаданных, СтруктураОбъекта, СсылкаНаОбъект);	
		
		ДобавлениеПризнакаВыгружатьВсегда(ИмяСБИС, СтруктураОбъекта);
		
		//Попытка
		СтруктураОбъекта.Вставить("ИмяСБИС", ИмяСБИС);
		//Исключение
		//	ИнфОбОшибке	= ИнформацияОбОшибке();
		//	ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Ошибка в блоке, не заполнен обязательный параметр", "ИмяСБИС в блоке " + block_type + "",, add_block_to_dump(block_context)));
		//КонецПопытки;   
		Если РазделитьИмяИС = Ложь Тогда 
			СтруктураОбъекта.Вставить("ИмяИС", ТипМетаданных + "." + ОбъектМетаданных.Имя );
		Иначе
			СтруктураОбъекта.Вставить("ИмяИС", ОбъектМетаданных.Имя );
			СтруктураОбъекта.Вставить("ТипИС", ТипМетаданных);		
		КонецЕсли;	
		//СтруктураОбъекта.Вставить("ini_name", "Выгрузка_" + ОбъектМетаданных.Имя); 
		Если ini_name <> Неопределено Тогда
			СтруктураОбъекта.Вставить("ini_name", "");
		КонецЕсли;	
		СтруктураОбъекта.Вставить("Представление", Строка(СсылкаНаОбъект));
		Если ДобавлятьЗаголовок Тогда
			СтруктураОбъекта.Вставить("Title", Строка(СсылкаНаОбъект));
		КонецЕсли;

	КонецЕсли;
	
	Возврат СтруктураОбъекта;
КонецФункции

Процедура ДобавлениеПризнакаВыгружатьВсегда(ИмяСБИС, СтруктураОбъекта)
	Если ИмяСБИС = "ЧастноеЛицо" или ИмяСБИС = "Сотрудник" Тогда
		СтруктураОбъекта.Вставить("ВыгружатьВсегда", "да"); 	
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьТипМетаданныхИзОбъектаМетаданных(ОбъектМетаданных, СтруктураОбъекта, СсылкаНаОбъект)
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "Справочники";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект.УникальныйИдентификатор()));
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "Документы";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект.УникальныйИдентификатор()));
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "Перечисления";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект));
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "ПланыВидовРасчета";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект));
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "ПланыСчетов";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект.УникальныйИдентификатор()));
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "БизнесПроцессы";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект.УникальныйИдентификатор()));
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		ТипМетаданных = "Задачи";
		СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект.УникальныйИдентификатор()));
	Иначе
		Если Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
			ТипМетаданных = "ПланыВидовХарактеристик";
			СтруктураОбъекта.Вставить("ИдИС", XMLСтрока(СсылкаНаОбъект));
		КонецЕсли;
	КонецЕсли;
	Возврат ТипМетаданных;
КонецФункции


#Область include_BlocklyExecutor_base_Helper_DecodeEncode
#КонецОбласти


