
// IniUpdate
//
// Параметры:
// 	_Ини - Структура - Имя
//
// Возвращаемое значение:
//  - Результат - Структура
//
//DynamicDirective
Функция IniUpdate(_Ини) Экспорт
	ИмяПродукта = НазваниеПродукта();	
	Попытка
		_Ини["Name"] = ?(Найти(_Ини["Name"], "Blockly_") = 1, _Ини["Name"], "Blockly_"+_Ини["Name"]);
		Ini.Вставить(_Ини["Name"], _Ини["Value"]);
		_Ini = encode_xdto_xml(Ini);
		СуффиксХраненияИНИ = СтрЗаменить(context.params.ApiUrl, "https://", "");
		ЗаписатьВХранилище(ИмяПродукта, "Ini" + СуффиксХраненияИНИ, _Ini,,ИмяПродукта);
		Результат = Новый Структура("Result, Status", Неопределено, "complete");
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Результат = Новый Структура("Result, Status", ОшибкаСтруктура, "error");
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Функция IniGet
//
// Параметры:
// 	Имя - Структура - Имя
//
// Возвращаемое значение:
//  - XML - Результат работы метода
//
//DynamicDirective
Функция IniGet(Имя) Экспорт
	Попытка
		Если get_prop(Ini, Имя) = Неопределено Тогда
			ВызватьИсключение NewExtExceptionСтрока(,"Отсутствует ини", Имя);
		КонецЕсли;
		Возврат Ini[Имя]; //todo если инишки нет вернуть исключение "че нить не найдено"	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке, "Ошибка чтения ini", "(" + Имя + ")");
	КонецПопытки;
КонецФункции

// Функция CalcIni
//
// Параметры:
// 	ПараметрыВызова - Структура - Параметры Вызова
//
// Возвращаемое значение:
//  - Соответствие - Результат работы метода
//
//DynamicDirective
Функция CalcIni(ПараметрыВызова) Экспорт
	ДокDOM = ПолучитьДокументDOM(IniGet(ПараметрыВызова["Algorithm"]));
	ОбновитьСтруктуру(context_variables_get(context), get_prop(ПараметрыВызова, "EndpointArgs"));
	
	ОбщиеПараметры = get_prop(context.params,"public", Новый Структура);
	Если ТипЗнч(ОбщиеПараметры) = Тип("Структура") Тогда
		ОбновитьСтруктуру(context_variables_get(context), ОбщиеПараметры);
	КонецЕсли;
	
	РезультатРаботыБлока = blockly_executor_execute(ДокDOM, ПараметрыВызова["Endpoint"]);
	Возврат РезультатРаботыБлока;
КонецФункции

// Функция LocalCalcIniServer
//
// Параметры:
// 	ПараметрыВызова - Структура - Параметры Вызова
//
// Возвращаемое значение:
//  - Соответствие - Результат работы метода
//
Функция LocalCalcIniServer(ПараметрыВызова) Экспорт
	МодульОбъекта = МодульОбъекта();
	Возврат МодульОбъекта.LocalCalcIni(ПараметрыВызова);	
КонецФункции

// Функция LocalCalcIni
//
// Параметры:
// 	ПараметрыВызова - Структура - Параметры Вызова
//
// Возвращаемое значение:
//  - Соответствие - Результат работы метода
//
//DynamicDirective
Функция LocalCalcIni(ПараметрыВызова) Экспорт 
	ТипТранспортаСервер = ТранспортИнтеграции.ЭтоСервер();
	Если ТипТранспортаСервер = Истина Тогда
		Результат = LocalCalcIniServer(ПараметрыВызова); 
		Возврат Результат;
	КонецЕсли;	
	ПрочитатьСессиюОтладки();
	ПриЗапускеРобота(ПараметрыВызова);
	Возврат ExternalCalcIni(ПараметрыВызова);
КонецФункции

// Функция ExternalCalcIni
//
// Параметры:
// 	ПараметрыКоманды - Соответствие - Параметры Команды
//
// Возвращаемое значение:
//  - Соответствие - Результат работы метода
//
//DynamicDirective
Функция ExternalCalcIni(ПараметрыКоманды) 
	Если ТипЗнч(get_prop(ПараметрыКоманды, "params")) = Тип("Структура") Тогда
		Load_ini( ПараметрыКоманды["Algorithm"], ПараметрыКоманды);
		context.params = ПараметрыКоманды["params"];
	Иначе
		Load_ini( ПараметрыКоманды["Algorithm"] );
	КонецЕсли;
	Результат = CalcIni(ПараметрыКоманды);
	
	СохранитьСессиюОтладки();
	
	Возврат Результат;
КонецФункции

// Функция Load_ini
//
// Параметры:
//  ИмяИни - Строка - Имя Ини
// 	ПараметрыПодключения - Структура - Параметры Подключения
//
// Возвращаемое значение:
//  - XML - Результат работы метода
//
// Нет необходимости превращять целую функцию в разрозненный набор методов идя на поводу у сонара
//DynamicDirective
Функция Load_ini( ИмяИни, ПараметрыПодключения = Неопределено ) Экспорт 
	ИмяИни = ?(Найти(ИмяИни, "Blockly_") = 1, ИмяИни, "Blockly_" + ИмяИни);
	мИниФайлов	= Новый Массив();
	мИниФайлов.Добавить(Новый Структура("Тип, ИмяФайла", "Blockly", ИмяИни));
	ПодготовитьИниИКонтекст();
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИспользоватьКэш", Истина);
	ДополнительныеПараметры.Вставить("КэшИни", Ini);
		
	Если ПараметрыПодключения = Неопределено Тогда
		connection_uuid = context.operation.connection_uuid;
		Если НЕ ЗначениеЗаполнено(connection_uuid) Тогда
			connection_uuid = get_prop(context.params, "ConnectionUuid");
		КонецЕсли;	
		ДополнительныеПараметры.Вставить("context_params", context.params);
	Иначе
		Если context = Неопределено Тогда
			//Зашли при загрузке инишки из команды формы
			//перед вызовом - API_BLOCKLY_RUN
			context = new_context();
		КонецЕсли;
		context.Вставить("params", ПараметрыПодключения["params"] );
		connection_uuid = get_prop(ПараметрыПодключения,"ConnectionId", get_prop(ПараметрыПодключения, "ConnectionUuid"));
		ДополнительныеПараметры.Вставить("context_params", ПараметрыПодключения["params"]);
	КонецЕсли;                                
	ДополнительныеПараметры.Вставить("requested_ini_format", "Dom1C");
	Результат = ТранспортИнтеграции.ПрочитатьПИМ(connection_uuid, мИниФайлов, ДополнительныеПараметры); 
	ДанныеИНИ = get_prop(Результат, ИмяИни); 
	Если ТипЗнч(ДанныеИНИ) <> Тип("Строка") Или ПустаяСтрока(ДанныеИНИ) Тогда 
		ВызватьИсключение NewExtExceptionСтрока(, "Отсутствует ини файл - " + ИмяИни, "Load_ini");
	КонецЕсли;
	Ini.Вставить(ИмяИни, ДанныеИНИ);
	Возврат ДанныеИНИ;
КонецФункции

//DynamicDirective
Процедура ПодготовитьИниИКонтекст()
	ТипСтрока = Тип("Строка");
	
	Если Ini = Неопределено Тогда
		Ini = Новый Соответствие;
	Иначе
		Если ТипЗнч(Ini) = ТипСтрока Тогда
			//вторая и дальнейшие итерации вызова API_BLOCKLY_RUN,  По окончании которого СохранитьСессиюОтладки() превращает ini в XML строку
			Ini = decode_xml_xdto(Ini);       
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(context) = ТипСтрока Тогда
		//Раньше мы сохраняли контекст, теперь чистим его при завершении обсчета. Оставил для неведомой совместимости
		context = decode_xml_xdto(context);
	КонецЕсли;		
КонецПроцедуры

// ОбработатьКоманды
//
// Параметры:
//  Команды - Массив - Команды
//
// Возвращаемое значение:
//  Массив - Результат работы метода
//
//DynamicDirective
Функция ОбработатьКоманды(Команды)
	РезультатКоманд = Новый Массив;
	Для Каждого Команда из Команды Цикл
		ПараметрыКоманды = Команда["Params"];
		ИмяКоманды = Команда["Name"];
		ИдКоманды = Команда["Uuid"];
		Попытка
			Если ИмяКоманды = "BlocklyUpdateIni" Тогда
				Результат = IniUpdate(ПараметрыКоманды);
			КонецЕсли;
			Если ИмяКоманды = "ExecuteBlockly" Тогда				
				ПриЗапускеРобота(ПараметрыКоманды);
				context.report.Вставить("new", Истина);
				Результат = ExternalCalcIni(ПараметрыКоманды);				
			КонецЕсли;
			Если ЗначениеЗаполнено(ИдКоманды) Тогда
				РезультатКоманд.Добавить(Новый Структура("Uuid, Result, Status", ИдКоманды, Результат.Result, Результат.Status));
			КонецЕсли;
			
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			РезультатКоманд.Добавить(Новый Структура("Uuid, Result, Status", ИдКоманды, NewExtExceptionСтруктура(ИнфОбОшибке,"Ошибка ОбработатьКоманды",ИмяКоманды), "error"));
		КонецПопытки;	
	КонецЦикла;
	Возврат РезультатКоманд;
КонецФункции

