
Процедура ПриЗапускеРобота(ПараметрыВызова)
	Попытка
		StepByStep = Неопределено;
		StepByStep = ПараметрыВызова.Получить("debug");
		Если ТипЗнч(StepByStep) <> Тип("Булево") Тогда
			StepByStep = Ложь;
		КонецЕсли;
		Step = ПараметрыВызова["step"];
		Selected = ПараметрыВызова["selected"];
		NextStep = ?(StepByStep И НЕ ЗначениеЗаполнено(Step), Истина, Неопределено);
	Исключение
		StepByStep = Ложь;
	КонецПопытки;
	ПервыйЗапуск = Истина;
	Если ЗначениеЗаполнено(Step) Тогда
		ПервыйЗапуск = Ложь;			
	КонецЕсли;	
	Если Ini = Неопределено Тогда
		Ini = Новый Соответствие;
	КонецЕсли;	
	Если context = Неопределено Или ПервыйЗапуск Тогда
		context = new_context();
	КонецЕсли;
	context.Вставить("commands", Новый Массив);
	context.Вставить("limit_commands", 3);
	operation_uuid = "";
	connection_uuid	= "";
	Если ТипЗнч(ПараметрыВызова) = Тип("Структура") или ТипЗнч(ПараметрыВызова) = Тип("Соответствие") Тогда
		operation_uuid = get_prop(ПараметрыВызова, "operation_uuid", Неопределено);
		Если Не ЗначениеЗаполнено(operation_uuid) Тогда
			operation_uuid = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		connection_uuid = get_prop(ПараметрыВызова, "connection_uuid", Неопределено);
		context.Вставить("command_result", ПреобразоватьМассивСтруктурВСоответствие(get_prop(ПараметрыВызова, "commands_result"), "uuid"));
	КонецЕсли;
	context.operation.Вставить("operation_uuid",operation_uuid);
	Попытка
		ИмяНастроек = ПолучитьИмяПродукта();
		//Заполняются параметры подключения по данным connection_uuid, запуск из редактора блоки
		params = ПрочитатьИзХранилища(ИмяНастроек, "params"+connection_uuid,,);
		Если params = Неопределено Тогда
			params = ПрочитатьИзХранилища(ИмяНастроек, "params",,);			
		КонецЕсли;
		Если ЗначениеЗаполнено(params) Тогда
			Для Каждого КлючИЗначениеПараметр Из params Цикл
				context.params.Вставить(КлючИЗначениеПараметр.Ключ, КлючИЗначениеПараметр.Значение);
			КонецЦикла;
		КонецЕсли;	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Ошибки подготовки параметров."));
	КонецПопытки;
	Если Не ЗначениеЗаполнено(connection_uuid) Тогда
		connection_uuid = get_prop(context.params,"ConnectionId","");
	КонецЕсли;
	context.operation.Вставить("connection_uuid",connection_uuid);
	
КонецПроцедуры

Процедура ЗаписатьПараметрыРобота(ИмяРобота)
	ИмяНастроек = ПолучитьИмяПродукта();
	ХранилищеОбщихНастроек.Сохранить(ИмяНастроек, ИмяРобота, ПараметрыРобота,,);
КонецПроцедуры

Процедура ПрочитатьПараметрыРобота(ИмяРобота)
	ИмяНастроек = ПолучитьИмяПродукта();
	ПараметрыРобота = ПрочитатьИзХранилища(ИмяНастроек, ИмяРобота,,);		
КонецПроцедуры
