
// Функция ПолучитьHTTPСоединение
//
// Параметры:
//  АвторизацияОнлайн - Строка - Название блока
//  АдресСервера - Строка - Адрес Сервера
//
// Возвращаемое значение:
//  - HTTPСоединение - HTTP Соединение
//
Функция ПолучитьHTTPСоединение(АвторизацияОнлайн, АдресСервера)
	//Вызывается из формы Browser для пользователя-редактора ini, наличие прокси не критично
	_АдресСервиса = ПолучитьАдресСервиса(АвторизацияОнлайн, АдресСервера, Ложь);
	_ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Если найти(АдресСервера, "localhost") Тогда
		_ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	ТаймАутСекунд180 = 180;
	Возврат	Новый HTTPСоединение(_АдресСервиса, , , , ,ТаймАутСекунд180 , _ЗащищенноеСоединение);
КонецФункции

// Функция ПолучитьАдресСервиса
//
// Параметры:
//  СерверOnline - Строка - Сервер Online
//  АдресСервера - Строка - Адрес Сервера
//  ДобавитьПротокол - Булево - Признак добаления протокола в адрес
//
// Возвращаемое значение:
//  - Строка - АдресСервера
//
Функция ПолучитьАдресСервиса(СерверOnline, АдресСервера, ДобавитьПротокол = Истина) Экспорт	
	Возврат АдресСервера;	
КонецФункции

// Функция СформироватьЗаголовкиЗапроса
//
// Параметры:
//  РесурсЗапроса - Строка - Ресурс Запроса
//
// Возвращаемое значение:
//  - Соответствие - Заголовки
//
Функция СформироватьЗаголовкиЗапроса(РесурсЗапроса = "")	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/xml; charset=utf-8");
	ДанныеОВерсии = ПолучитьИмяФайлаИНомерТекущейВерсии();
	ИдПриложения = "1С8;"+ДанныеОВерсии[0]+ДанныеОВерсии[1];
	Если ИдПриложения <> Неопределено Тогда
		Заголовки.Вставить("User-Agent", ИдПриложения);
	КонецЕсли;	
	Если ВРег(РесурсЗапроса) <> "АВТОРИЗАЦИЯ" Тогда
		Заголовки.Вставить("X-SBISSessionID", ПолучитьИдентификаторСессии());
	КонецЕсли;	
	Возврат Заголовки;	
КонецФункции

// Функция ПолучитьИдентификаторСессии
//
// Параметры:
//  _ПараметрыРобота_ - Структура - Параметры Робота
//
// Возвращаемое значение:
//  - Строка - ИдентификаторСессии
//
Функция ПолучитьИдентификаторСессии( _ПараметрыРобота_ = Неопределено )
	Если ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		Возврат ИдентификаторСессии;
	КонецЕсли;	
	
	Если _ПараметрыРобота_ <> Неопределено Тогда
		ПараметрыРобота = _ПараметрыРобота_;
	КонецЕсли;
	
	Хост = ПараметрыРобота["host"];
	Если ПараметрыРобота["host"] = "localhost" Тогда
		Хост = ПараметрыРобота["host2"]
	КонецЕсли;	
	Соединение = ПолучитьHTTPСоединение(Истина, Хост);
	ЗапросСервису = ПолучитьHTTPЗапрос("Авторизация");
	ОтветАвторизации = Соединение.ОтправитьДляОбработки(ЗапросСервису);
	
	ТекстОтвета = ОтветАвторизации.ПолучитьТелоКакСтроку();
	ДанныеОтвета = local_helper_json_decode(ТекстОтвета);
	ИдентификаторСессии = ДанныеОтвета.Получить("result");
	Возврат ИдентификаторСессии;
КонецФункции


// Функция ЗавершитьСессиюСбис
//
// Возвращаемое значение:
//  - Булево - Признак успешного результат обсчета алгоритма
//
Функция ЗавершитьСессиюСбис()
	Соединение = ПолучитьHTTPСоединение(Истина, ПараметрыРобота["host"]);
	
	ДопЗаголовки = Новый Соответствие;
	ДопЗаголовки.Вставить("X-SBISSessionID", ИдентификаторСессии);
	ЗапросСервису = ПолучитьHTTPЗапрос("Выход", ДопЗаголовки);
	ЗапросСервису.УстановитьТелоИзСтроки(СформироватьТекстЗапроса("СБИС.Выход"));
	
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросСервису);
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	ОтветВозврат = local_helper_json_decode(ТекстОтвета, Ложь);
	Успешно = ОтветВозврат.Свойство("result") И ОтветВозврат.result = Неопределено;
	Возврат Успешно;
КонецФункции

// Функция ПолучитьHTTPЗапрос
//
// Параметры:
//  РесурсЗапроса - Строка - Название блока
//  ДополнительныеЗаголовки - Структура - Доп HTTP заголовки 
//  ДополнительныеПараметры - Структура - Дополнительные Параметры
//
// Возвращаемое значение:
//  - HTTPЗапрос  - HTTP Запрос
//
Функция ПолучитьHTTPЗапрос(РесурсЗапроса, ДополнительныеЗаголовки = Неопределено, ДополнительныеПараметры = Неопределено)
	АдресРесурса = "";
	СтрокаТелаЗапроса = "";
	Если ВРег(РесурсЗапроса) = "АВТОРИЗАЦИЯ" Тогда
		АдресРесурса = "/auth/service/";
		КомандаСБИС = "СБИС.Аутентифицировать";
		Если ДополнительныеПараметры = Неопределено Тогда
			СтруктураПараметровЗапроса = Новый Структура("Пароль, Логин",
				ПараметрыРобота["Пароль"],
				ПараметрыРобота["Логин"]); // ЛОГИН ПАРОЛЬ
		КонецЕсли;
		СтрокаТелаЗапроса = СформироватьТекстЗапроса(КомандаСБИС, СтруктураПараметровЗапроса);
	ИначеЕсли ВРег(РесурсЗапроса) = "ВЫХОД" Тогда
		АдресРесурса = "/auth/service/";
	Иначе
		Если Врег(РесурсЗапроса) = "СКАЧАТЬ" Тогда
			АдресРесурса = "/service/?srv=1";
			КомандаСБИС = "СБИС.Аутентифицировать";
		КонецЕсли;
	КонецЕсли;
	ЗапросСервису = Новый HTTPЗапрос(АдресРесурса, СформироватьЗаголовкиЗапроса(РесурсЗапроса));	
	Если СтрокаТелаЗапроса <> "" Тогда
		ЗапросСервису.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);	
	КонецЕсли;
	Возврат ЗапросСервису;
КонецФункции

// Функция СформироватьТекстЗапроса
//
// Параметры:
//  Метод - Строка - Название блока
//  СтруктураПараметровЗапроса - Структура - Параметров Запроса
//  ПротоколЗапроса - Число - Протокол Запроса
//
// Возвращаемое значение:
//  - Строка - Текст Запроса
//
Функция СформироватьТекстЗапроса(Метод, СтруктураПараметровЗапроса=Неопределено, ПротоколЗапроса=4)
	ТекстЗапроса = "{""jsonrpc"":""2.0"",""method"":""" + Метод+""", ""protocol"": " + Формат(ПротоколЗапроса, "ЧГ=") + ", ""params"":{";
	Если СтруктураПараметровЗапроса <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + ЗаписатьПараметрыЗапроса(СтруктураПараметровЗапроса);
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "},""id"":1}";	
	ТекстЗапроса = СтрЗаменить(СтрЗаменить(ТекстЗапроса,Символы.ПС," "), Символы.ВК, " ");
	Возврат ТекстЗапроса;	
КонецФункции

// Функция ЗаписатьПараметрыЗапроса
//
// Параметры:
//  СтруктураПараметровЗапроса - Структура - Параметров Запроса
//
// Возвращаемое значение:
//  - Строка - Текст Запроса
//
// Нет возможности получить более понятный код
Функция ЗаписатьПараметрыЗапроса(СтруктураПараметровЗапроса)	
	ТекстЗапроса = "";
	Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			ТекстЗапроса = ТекстЗапроса + """" + Элемент.Ключ + """:""" + СтрЗаменить(Элемент.Значение, """", "\""")
			+ """,";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число")
			ИЛИ ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			ТекстЗапроса = ТекстЗапроса + """" + Элемент.Ключ + """:""" + строка(Элемент.Значение) + """,";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Неопределено") Тогда
			ТекстЗапроса = ТекстЗапроса + """" + Элемент.Ключ + """:"""",";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			ТекстЗапроса = ТекстЗапроса + """" + Элемент.Ключ + """:{" + ЗаписатьПараметрыЗапроса(Элемент.Значение) + "},";
		Иначе
// Некорректные требования сонара
            ПараметрыЗапросаДляИтерируемогоОбъекта(Элемент.Значение, Элемент.Ключ);
		КонецЕсли;		
	КонецЦикла;
	Если Прав(ТекстЗапроса, 1) = "," Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1);
	КонецЕсли;
	Возврат ТекстЗапроса;
КонецФункции

Процедура ПараметрыЗапросаДляИтерируемогоОбъекта(Элемент_Значение, Элемент_Ключ)
	Если ТипЗнч(Элемент_Значение) = Тип("Массив") Тогда
		ТекстЗапроса = ТекстЗапроса + """" + Элемент_Ключ + """:[";
		Для Каждого ЭлементМассива Из Элемент_Значение Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
				ТекстЗапроса = ТекстЗапроса + "{";				
				ТекстЗапроса = ТекстЗапроса + ЗаписатьПараметрыЗапроса(ЭлементМассива);
				ТекстЗапроса = ТекстЗапроса + "},";
			Иначе
				ТекстЗапроса = ТекстЗапроса + """" + строка(ЭлементМассива);
				ТекстЗапроса = ТекстЗапроса + """,";
			КонецЕсли;	
		КонецЦикла;
		Если Прав(ТекстЗапроса, 1) = "," Тогда
			ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1);
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "],";
	КонецЕсли;	
КонецПроцедуры
