
// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
Функция СтруктураURI(Знач СтрокаURI)
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиции = СтрРазделить82(СтрокаСоединения, "@");
	Если Позиции.Количество() > 1 Тогда
		ИмяСервера = Позиции[Позиции.Количество() - 1];
		СтрокаАвторизации = Лев(СтрокаСоединения, СтрДлина(ИмяСервера) - 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не ТолькоЦифрыВСтроке(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Если ПустаяСтрока(Порт) Тогда
		Порт = Неопределено;
	Иначе
		Порт = Число(Порт);
	КонецЕсли;
	Результат.Вставить("Порт", Порт);
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

// Создает объект описания защищенного соединения OpenSSL.
// См. также описание объекта ЗащищенноеСоединениеOpenSSL в синтаксис-помощнике.
//
// Параметры:
//  СертификатКлиента - СертификатКлиентаФайл
//                    - СертификатКлиентаWindows
//                    - Неопределено - клиентский сертификат OpenSSL.
//  СертификатыУдостоверяющихЦентров - СертификатыУдостоверяющихЦентровФайл
//                                   - СертификатыУдостоверяющихЦентровWindows
//                                   - СертификатыУдостоверяющихЦентровLinux
//                                   - СертификатыУдостоверяющихЦентровОС
//                                   - Неопределено - сертификаты удостоверяющих центров OpenSSL. 
//
// Возвращаемое значение:
//  ЗащищенноеСоединениеOpenSSL
//
Функция НовоеЗащищенноеСоединение(СертификатКлиента = Неопределено, СертификатыУдостоверяющихЦентров = Неопределено)
	
	#Если ВебКлиент Тогда
		Возврат Неопределено;
	#ИначеЕсли МобильныйКлиент Тогда 
		Возврат Новый ЗащищенноеСоединениеOpenSSL;
	#Иначе
		Возврат Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиента, СертификатыУдостоверяющихЦентров);
	#КонецЕсли
	
КонецФункции

// Функция НовоеHTTPСоединение
//
// Параметры:
//  ПараметрыСоединения - Структура - Параметры Соединения
//  Таймаут - Число - Таймаут в секундах
//  context_param - Структура - Параметры пользователяч
//
// Возвращаемое значение:
//  - HTTPСоединение - Результат обсчета алгоритма
//
// Код разнесен областями и не понятно куда выносить константу для числа 180
// BSLLS:MagicNumber-off
Функция НовоеHTTPСоединение(ПараметрыСоединения, Таймаут = 180, context_param = Неопределено)
	
	ИнтернетПрокси = Неопределено;
	ЗащищенноеСоединение = Неопределено;
	Если ВРег(ПараметрыСоединения.Схема) = "HTTPS" Или ВРег(ПараметрыСоединения.Схема) = "FTPS" Тогда
		ЗащищенноеСоединение = НовоеЗащищенноеСоединение();
	КонецЕсли;
	ProxyParam	= Неопределено;
	ИнтернетПрокси = Неопределено;
	Если context_param.Свойство("Proxy", ProxyParam) Тогда
		ИспользоватьАутентификациюОС = get_prop(ProxyParam, "ИспользоватьАутентификациюОС", Ложь);
		ИнтернетПрокси = Новый ИнтернетПрокси;
		ИнтернетПрокси.Установить(
			ProxyParam.Protocol,
			ProxyParam.Server,
			Число(ProxyParam.Port),
			ProxyParam.User,
			ProxyParam.Password,
			ИспользоватьАутентификациюОС);
	КонецЕсли;
	Соединение = Новый HTTPСоединение(
		ПараметрыСоединения.ИмяСервера,
		ПараметрыСоединения.Порт,
		,
		,
		ИнтернетПрокси,
		Таймаут,
		ЗащищенноеСоединение);
	
	Возврат Соединение;
КонецФункции
// BSLLS:MagicNumber-on

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3",, Ложь); // Истина
//
Функция ТолькоЦифрыВСтроке(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина)
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
	
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
	Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
КонецФункции

// Функция ПараметрыСоединения
//
// Параметры:
//  АдресСервера - Строка - Адрес Сервера
//
// Возвращаемое значение:
//  - Структура - Параметры Соединения
//
Функция ПараметрыСоединения(АдресСервера)
	СтруктураURI = СтруктураURI(АдресСервера);
	
	ПараметрыСоединения = Новый Структура("Хост,Порт,ПутьНаСервере,Схема,ИмяСервера,Логин,Пароль");
	ЗаполнитьЗначенияСвойств(ПараметрыСоединения, СтруктураURI);
	
	Возврат ПараметрыСоединения;
КонецФункции

// Функция ЗагрузитьВременныеФайлыНаДискСБИС
//
// Параметры:
//  context_params - Структура - Параметры подключения
//  ДанныеДляЗагрузки - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Структура - ДанныеДляЗагрузки
//
//DynamicDirective
Функция ЗагрузитьВременныеФайлыНаДискСБИС(Знач context_params, Знач ДанныеДляЗагрузки) Экспорт
	
	Если ТранспортИнтеграции.УИДСессии(context_params) = Неопределено Тогда
		ТранспортИнтеграции.ВойтиТранспорт(context_params);
	КонецЕсли;
	
	Если ДанныеДляЗагрузки = Неопределено Тогда
	 	Возврат ДанныеДляЗагрузки;
	КонецЕсли; 

	ПараметрыСоединения = ПараметрыСоединения(context_params.api_url);
	ПараметрыСоединения.Логин = context_params.login;
	ПараметрыСоединения.Пароль = context_params.password;
	ПараметрыСоединения.ПутьНаСервере = "/disk/api/v1/temp/";
	
	Соединение = НовоеHTTPСоединение(ПараметрыСоединения, , context_params);
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Disposition", "attachment");
	ЗаголовкиHTTP.Вставить("Cookie", "sid=" + ТранспортИнтеграции.УИДСессии(context_params));
	
	Для каждого Вложение Из ДанныеДляЗагрузки Цикл
		Файл = Вложение["Файл"]; 
		Base64 = get_prop(Файл, "ДвоичныеДанные");
		
		ДвоичныеДанные = ПолучитьДвоичныеДанные(Файл, Base64);
		
		Если ДвоичныеДанные = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		 
		ЗаголовкиHTTP.Вставить("Content-Type", Файл["ContentType"]);
		КодированнаяСтрокаНаСервере = КодироватьСтрокуНаСервере(Файл["Имя"], 
			ПредопределенноеЗначение("СпособКодированияСтроки.КодировкаURL"),
			"UTF-8");
		ЗаголовкиHTTP.Вставить("Content-Disposition", 
			"attachment;filename*=UTF-8''" + КодированнаяСтрокаНаСервере);
		
		ЗапросHTTP = Новый HTTPЗапрос(ПараметрыСоединения.ПутьНаСервере, ЗаголовкиHTTP);
			
		ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
		
		ОтветHTTP = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
		СтрокаОтветаHTTP = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		КодОК = 200;
		КодCreated = 201;
		
		Если ОтветHTTP.КодСостояния = КодОК Или ОтветHTTP.КодСостояния = КодCreated Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаОтветаHTTP);
			#Если ВебКлиент Тогда
				Ответ = ПрочитатьJSONНаСервере(ЧтениеJSON, Истина);
			#Иначе	
				Ответ = ПрочитатьJSON(ЧтениеJSON, Истина);
			#КонецЕсли	
			Файл.Вставить("Ссылка", Ответ.Получить("href"));
		Иначе
			Файл.Вставить("ДвоичныеДанные", Base64);
			NewExtExceptionСтрока(, "Ошибка загрузки на СБИС диск.", 
				ОтветHTTP.КодСостояния, ,
				Новый Структура("body", ОтветHTTP.ПолучитьТелоКакСтроку()));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеДляЗагрузки;
КонецФункции

Функция ПолучитьДвоичныеДанные(Файл, Base64)
	Если get_prop(Файл, "Ссылка") <> Неопределено Тогда
		Возврат Неопределено; // Файл уже загружен на первой итерации отправки списочного документа
	Иначе
		Если НЕ ЗначениеЗаполнено(Base64) Тогда
			// Пытаемся отправить не существующее вложение.
			Возврат Неопределено;
		КонецЕсли;
		Если ТипЗнч(Base64) = Тип("ДвоичныеДанные") Тогда
			Возврат Base64;
		ИначеЕсли ТипЗнч(Base64) = Тип("Строка") Тогда
			Возврат Base64Значение(Base64);
		Иначе
			Возврат Неопределено; // Неверный тип данных
		КонецЕсли;
		Файл.Удалить("ДвоичныеДанные");
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
