


&НаСервере
Функция ФайлНаДискСБИСНаСервере(Знач ДвоичныеДанные, Знач request_url, Знач kwargs, Знач context_params)
	МодульОбъекта = МодульОбъекта();
	ИмяВременногоФайлаНаСервере = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(ИмяВременногоФайлаНаСервере);
	kwargs.Вставить("data", ИмяВременногоФайлаНаСервере);
	Результат = МодульОбъекта.local_helper_exec_request_HTTPСоединение("post_binary", request_url, "json",
																				kwargs, context_params);
	
	// BSLLS:UsingSynchronousCalls-off - для совместимости со старыми платформами
	УдалитьФайлы(ИмяВременногоФайлаНаСервере);
	// BSLLS:UsingSynchronousCalls-on
	Возврат Результат;
КонецФункции

//DynamicDirective

Процедура ЗагрузитьВложениеНаДискСБИС(Вложение, request_url, ЗаголовкиHTTP, context_params)
	Если ЭтоВидТранспортаExtSdk(context_params) Тогда 
		ТранспортИнтеграции.UploadToSbisDisk(context_params, Вложение, request_url);  
		Возврат;
	КонецЕсли;
	
	Файл = Вложение["Файл"]; 
	Base64 = get_prop(Файл, "ДвоичныеДанные");
	
	ДвоичныеДанные = Saby_ПолучитьДвоичныеДанные(Файл, Base64);
	Если ДвоичныеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗаголовкиHTTP.Вставить("Content-Type", Файл["ContentType"]);
	КодированнаяСтрокаНаСервере = КодироватьСтрокуНаСервере(Файл["Имя"], 
									ПредопределенноеЗначение("СпособКодированияСтроки.КодировкаURL"),
									"UTF-8");
	ЗаголовкиHTTP.Вставить("Content-Disposition", 
							"attachment;filename*=UTF-8''" + КодированнаяСтрокаНаСервере);
	
	kwargs = Новый Структура;
	kwargs.Вставить("headers", ЗаголовкиHTTP);
	#Если ВебКлиент Тогда
		Результат = ФайлНаДискСБИСНаСервере(ДвоичныеДанные, request_url, kwargs, context_params);	
	#Иначе	
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
		kwargs.Вставить("data", ИмяВременногоФайла);
		Результат = ТранспортИнтеграции.local_helper_exec_request_HTTPСоединение("post_binary", request_url, "json",
																				kwargs, context_params);
	
	// BSLLS:UsingSynchronousCalls-off - для совместимости со старыми платформами
		УдалитьФайлы(ИмяВременногоФайла);
	// BSLLS:UsingSynchronousCalls-on
	#КонецЕсли

	КодОК = 200;
	КодCreated = 201;
	Если Результат.code = КодОК Или Результат.code = КодCreated Тогда
		Ответ = Результат.result;
		Файл.Вставить("Ссылка", Ответ.Получить("href"));
	Иначе
		Файл.Вставить("ДвоичныеДанные", Base64);
		NewExtExceptionСтрока(, "Ошибка загрузки на СБИС диск.", 
		Результат.code, ,
		Новый Структура("body", Результат.result));
	КонецЕсли;
	
КонецПроцедуры

// Функция ЗагрузитьВременныеФайлыНаДискСБИС
//
// Параметры:
//  context_params - Структура - Параметры подключения
//  ДанныеДляЗагрузки - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Структура - ДанныеДляЗагрузки
//
//DynamicDirective
Функция ЗагрузитьВременныеФайлыНаДискСБИС(Знач context_params, Знач ДанныеДляЗагрузки) Экспорт
	
	Если ТранспортИнтеграции.УИДСессии(context_params) = Неопределено Тогда
		ТранспортИнтеграции.ВойтиТранспорт(context_params);
	КонецЕсли;
	
	Если ДанныеДляЗагрузки = Неопределено Тогда
	 	Возврат ДанныеДляЗагрузки;
	КонецЕсли; 

	request_url = context_params.ApiUrl + "/disk/api/v1/temp/";
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Disposition", "attachment");
	ЗаголовкиHTTP.Вставить("Cookie", "sid=" + ТранспортИнтеграции.УИДСессии(context_params));
	
	Если ТипЗнч(ДанныеДляЗагрузки) = Тип("Массив") Тогда	
		Для каждого Вложение Из ДанныеДляЗагрузки Цикл
			ЗагрузитьВложениеНаДискСБИС(Вложение, request_url, ЗаголовкиHTTP, context_params);			
		КонецЦикла;
	Иначе     
		ЗагрузитьВложениеНаДискСБИС(ДанныеДляЗагрузки, request_url, ЗаголовкиHTTP, context_params);				
	КонецЕсли;	
		
	Возврат ДанныеДляЗагрузки;
	
КонецФункции


//DynamicDirective

Функция Saby_ПолучитьДвоичныеДанные(Файл, Base64)
	Если get_prop(Файл, "Ссылка") = Неопределено 
		И ЗначениеЗаполнено(Base64) Тогда
		Если ТипЗнч(Base64) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные = Base64;
		ИначеЕсли ТипЗнч(Base64) = Тип("Строка") Тогда
			ДвоичныеДанные = Base64Значение(Base64);
		Иначе
			Возврат Неопределено; // Неверный тип данных
		КонецЕсли;
		Файл.Удалить("ДвоичныеДанные");
		Возврат ДвоичныеДанные;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции


