
Функция СконвертироватьВПДФА3(Знач context_params, Знач ДанныеДляЗагрузки)
	Если ДанныеДляЗагрузки = Неопределено Тогда
	 	Возврат ДанныеДляЗагрузки;
	КонецЕсли;
	Для каждого Вложение Из ДанныеДляЗагрузки Цикл
		Файл = Вложение["Файл"]; 
		Base64 = get_prop(Файл, "ДвоичныеДанные");
		Если get_prop(Файл, "Ссылка") <> Неопределено Тогда
			Продолжить; //Файл уже загружен на первой итерации отправки списочного документа
		КонецЕсли;
				
		СуффиксФайла = СтрРазделить82(Файл["Имя"],".");
		СуффиксФайла = СуффиксФайла[СуффиксФайла.Количество() - 1]; 
		СсылкаНаPDF = Неопределено;
		Если НРег(СуффиксФайла) <> "pdf" Тогда
			СсылкаНаPDF = local_helper_convert_to_pdfa_to_disk_x(context_params, Base64, Файл["Имя"]); 
		КонецЕсли;	

		Если get_prop(СсылкаНАPDF, "Convert", Ложь) и НРег(СуффиксФайла) <> "pdf" Тогда
			Файл.Вставить("Ссылка", get_prop(СсылкаНаPDF, "FileId"));
			Файл.Удалить("ДвоичныеДанные");
			Файл["Имя"] = get_prop(СсылкаНаPDF, "FileName");
			Файл["ContentType"] = "application/pdf";
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ДанныеДляЗагрузки;
КонецФункции

